andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define T2MR0          (*(reg32 *)(TMR2_BASE_ADDR + 0x18)))	// Registrador de comparação 0
#define T2MR1          (*(reg32 *)(TMR2_BASE_ADDR + 0x1C)))	// Registrador de comparação 1
#define T2MR2          (*(reg32 *)(TMR2_BASE_ADDR + 0x20)))	// Registrador de comparação 2
#define T2MR3          (*(reg32 *)(TMR2_BASE_ADDR + 0x24)))	// Registrador de comparação 3

#define T2CCR          (*(reg32 *)(TMR2_BASE_ADDR + 0x28))	// Registrador de controle de captura
	#define T2CCR_CR0_RISING	(1 << 0)     	  				// Habilita a captura do TC para CR0 durante a subida da borda CAPn.0
	#define T2CCR_CR0_FALLING	(1 << 1)    	    			// Habilita a captura do TC para CR0 durante a queda da borda CAPn.0
	#define T2CCR_CR0_INT 		(1 << 2)        				// Habilita a interrupção para ler o CR0
	#define T2CCR_CR1_RISING	(1 << 3)        				// Habilita a captura do TC para CR1 durante a subida da borda CAPn.1
	#define T2CCR_CR1_FALLING 	(1 << 4)        				// Habilita a captura do TC para CR1 durante a queda da borda CAPn.1
	#define T2CCR_CR1_INT 		(1 << 5)        				// Habilita a interrupção para ler o CR1

#define T2CR0          (*(reg32 *)(TMR2_BASE_ADDR + 0x2C))	// Registrador de captura 0
#define T2CR1          (*(reg32 *)(TMR2_BASE_ADDR + 0x30))	// Registrador de captura 1
#define T2EMR          (*(reg32 *)(TMR2_BASE_ADDR + 0x3C))	// Registrador de comparação externa
#define T2CTCR         (*(reg32 *)(TMR2_BASE_ADDR + 0x70))

// ########################################################################################################################################
// REGISTRADORES DO TIMER 3
#define TMR3_BASE_ADDR		0x40094000

#define T3IR           (*(reg32 *)(TMR3_BASE_ADDR + 0x00))	// Registrador de interrupções
	#define T3IR_MR0I    (1 << 0)        			    		// Flag de interrupção do canal de comparação 0
	#define T3IR_MR1I    (1 << 1)       			     		// Flag de interrupção do canal de comparação 1
	#define T3IR_MR2I    (1 << 2)       			     		// Flag de interrupção do canal de comparação 2
	#define T3IR_MR3I    (1 << 3)       			     		// Flag de interrupção do canal de comparação 3
	#define T3IR_CR0I    (1 << 4)        			    		// Flag de interrupção do canal de captura 0
	#define T3IR_CR1I    (1 << 5)         				   		// Flag de interrupção do canal de captura 1

#define T3TCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x04))	// Registrador de controle de timer
	#define T3TCR_ENABLE  (1 << 0)								// Habilita o contador do timer
	#define T3TCR_STOP    (0)									// Desabilita o contador do timer
	#define T3TCR_RESET   (1 << 1)								// Zera o contador do timer

#define T3TC           (*(reg32 *)(TMR3_BASE_ADDR + 0x08))	// Contador do timer

#define T3PR           (*(reg32 *)(TMR3_BASE_ADDR + 0x0C))	// Registrador do prescaler (0 a 0xFFFFFFFF)
	#define	T3MPR_DIV1		0
	#define	T3MPR_DIV2		1
	#define	T3MPR_DIV4		3
	#define	T3MPR_DIV8		7
	#define	T3MPR_DIV16		15
	#define	T3MPR_DIV32		31
	#define	T3MPR_DIV64		63
	#define	T3MPR_DIV128	127
	#define	T3MPR_DIV256	255
	#define	T3MPR_DIV512	511
	#define	T3MPR_DIV1024	1023

#define T3PC           (*(reg32 *)(TMR3_BASE_ADDR + 0x10))	// Contador do prescaler

#define T3MCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x14)))	// Registrador do controle de comparações (Match Control)
	#define T3MCR_NO_INT  				0						// Sem interrupções para match ou PWM
	#define T3MCR_MR0_INT_ENABLE  		(1 << 0)        		// Habilita a interrupção quando MR0 for igual a TC
	#define T3MCR_MR0_RESET  			(1 << 1)  		      	// Reseta MR0 quando ele for igual a TC
	#define T3MCR_MR0_STOP  			(1 << 2)       		 	// Para TC e PC quando MR0 for igual a TC
	#define T3MCR_MR1_INT_ENABLE  		(1 << 3)		     	// Habilita a interrupção quando MR1 for igual a TC
	#define T3MCR_MR1_RESET 			(1 << 4)       		 	// Reseta MR1 quando ele for igual a TC
	#define T3MCR_MR1_STOP  			(1 << 5)        		// Para TC e PC quando MR1 for igual a TC
	#define T3MCR_MR2_INT_ENABLE   		(1 << 6)       		 	// Habilita a interrupção quando MR2 for igual a TC
	#define T3MCR_MR2_RESET  			(1 << 7)        		// Reseta MR2 quando ele for igual a TC
	#define T3MCR_MR2_STOP  			(1 << 8)        		// Para TC e PC quando MR2 for igual a TC
	#define T3MCR_MR3_INT_ENABLE   		(1 << 9)        		// Habilita a interrupção quando MR3 for igual a TC
	#define T3MCR_MR3_RESET  			(1 << 10)       		// Reseta MR3 quando ele for igual a TC
	#define T3MCR_MR3_STOP  			(1 << 11)       		// Para TC e PC quando MR3 for igual a TC

#define T3MR0          (*(reg32 *)(TMR3_BASE_ADDR + 0x18)))	// Registrador de comparação 0
#define T3MR1          (*(reg32 *)(TMR3_BASE_ADDR + 0x1C)))	// Registrador de comparação 1
#define T3MR2          (*(reg32 *)(TMR3_BASE_ADDR + 0x20)))	// Registrador de comparação 2
#define T3MR3          (*(reg32 *)(TMR3_BASE_ADDR + 0x24))	// Registrador de comparação 3

#define T3CCR          (*(reg32 *)(TMR3_BASE_ADDR + 0x28))	// Registrador de controle de captura
	#define T3CCR_CR0_RISING	(1 << 0)     	  				// Habilita a captura do TC para CR0 durante a subida da borda CAPn.0
	#define T3CCR_CR0_FALLING	(1 << 1)    	    			// Habilita a captura do TC para CR0 durante a queda da borda CAPn.0
	#define T3CCR_CR0_INT 		(1 << 2)        				// Habilita a interrupção para ler o CR0
	#define T3CCR_CR1_RISING	(1 << 3)        				// Habilita a captura do TC para CR1 durante a subida da borda CAPn.1
	#define T3CCR_CR1_FALLING 	(1 << 4)        				// Habilita a captura do TC para CR1 durante a queda da borda CAPn.1
	#define T3CCR_CR1_INT 		(1 << 5)        				// Habilita a interrupção para ler o CR1

#define T3CR0          (*(reg32 *)(TMR3_BASE_ADDR + 0x2C))	// Registrador de captura 0
#define T3CR1          (*(reg32 *)(TMR3_BASE_ADDR + 0x30))	// Registrador de captura 1
#define T3EMR          (*(reg32 *)(TMR3_BASE_ADDR + 0x3C))	// Registrador de comparação externa
#define T3CTCR         (*(reg32 *)(TMR3_BASE_ADDR + 0x70))

//// ########################################################################################################################################
//// PWM0 - PULSE WIDTH MODULATOR
//#define PWM0_BASE_ADDR		0xE0014000
//
//#define PWM0IR          (*(reg32 *)(PWM0_BASE_ADDR + 0x00))			//  Interrupt Register
//	#define PW0MIR_MR0I  (1 << 0)            							// Flag de interrupção PWM0
//	#define PW0MIR_MR1I  (1 << 1)         						 		// Flag de interrupção PWM1
//	#define PW0MIR_MR2I  (1 << 2)    						       		// Flag de interrupção PWM2
//	#define PW0MIR_MR3I  (1 << 3)            							// Flag de interrupção PWM3
//	#define PW0MIR_MR4I  (1 << 8)            							// Flag de interrupção PWM4
//	#define PW0MIR_MR5I  (1 << 9)            							// Flag de interrupção PWM5
//	#define PW0MIR_MR6I  (1 << 10)           							// Flag de interrupção PWM6
//	#define PW0MIR_MASK  (0x070F)
//
//#define PWM0TCR         (*(reg32 *)(PWM0_BASE_ADDR + 0x04))        	// Timer Control Register
//#define PWM0TC          (*(reg32 *)(PWM0_BASE_ADDR + 0x08))         // Timer Counter
//#define PWM0PR          (*(reg32 *)(PWM0_BASE_ADDR + 0x0C))         // Prescale Register
//#define PWM0PC          (*(reg32 *)(PWM0_BASE_ADDR + 0x10))         // Prescale Counter Register
//#define PWM0MCR         (*(reg32 *)(PWM0_BASE_ADDR + 0x14))        	// Match Control Register
//	#define PWM0MCR_ENABLE 		(1 << 0)								// Habilita o contador do timer PWM
//	#define PWM0MCR_RESET  		(1 << 1)								// Zera o contador do timer PWM
//	#define PWM0MCR_PWM_ENABLE  (1 << 3)
//
//#define PWM0MR0         (*(reg32 *)(PWM0_BASE_ADDR + 0x18))			// Match Register 0
//#define PWM0MR1         (*(reg32 *)(PWM0_BASE_ADDR + 0x1C))     	// Match Register 1
//#define PWM0MR2         (*(reg32 *)(PWM0_BASE_ADDR + 0x20))			// Match Register 2
//#define PWM0MR3         (*(reg32 *)(PWM0_BASE_ADDR + 0x24))        	// Match Register 3
//#define PWM0CCR         (*(reg32 *)(PWM0_BASE_ADDR + 0x28))
//#define PWM0CR0         (*(reg32 *)(PWM0_BASE_ADDR + 0x2C))
//#define PWM0CR1         (*(reg32 *)(PWM0_BASE_ADDR + 0x30))
//#define PWM0CR2         (*(reg32 *)(PWM0_BASE_ADDR + 0x34))
//#define PWM0CR3         (*(reg32 *)(PWM0_BASE_ADDR + 0x38))
//#define PWM0EMR         (*(reg32 *)(PWM0_BASE_ADDR + 0x3C))
//#define PWM0MR4         (*(reg32 *)(PWM0_BASE_ADDR + 0x40))        	// Match Register 4
//#define PWM0MR5         (*(reg32 *)(PWM0_BASE_ADDR + 0x44))        	// Match Register 5
//#define PWM0MR6         (*(reg32 *)(PWM0_BASE_ADDR + 0x48))        	// Match Register 6
//#define PWM0PCR         (*(reg32 *)(PWM0_BASE_ADDR + 0x4C))        	// Control Register
//  	#define PWM0PCR_PWM_SEL2	(1 << 2)								// Seleciona o controle de dupla borda para o PWM2. 0 = borda simples / 1 = Dupla borda
//	#define PWM0PCR_PWM_SEL3	(1 << 3)								// Seleciona o controle de dupla borda para o PWM3. 0 = borda simples / 1 = Dupla borda
//	#define PWM0PCR_PWM_SEL4	(1 << 4)								// Seleciona o controle de dupla borda para o PWM4. 0 = borda simples / 1 = Dupla borda
//	#define PWM0PCR_PWM_SEL5	(1 << 5)								// Seleciona o controle de dupla borda para o PWM5. 0 = borda simples / 1 = Dupla borda
//	#define PWM0PCR_PWM_SEL6	(1 << 6)								// Seleciona o controle de dupla borda para o PWM6. 0 = borda simples / 1 = Dupla borda
//	#define PWM0PCR_PWM_ENABLE1	(1 << 9)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM0PCR_PWM_ENABLE2	(1 << 10)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM0PCR_PWM_ENABLE3	(1 << 11)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM0PCR_PWM_ENABLE4	(1 << 12)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM0PCR_PWM_ENABLE5	(1 << 13)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM0PCR_PWM_ENABLE6	(1 << 14)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//
//#define PWM0LER         (*(reg32 *)(PWM0_BASE_ADDR + 0x50))        	// Latch Enable Register
//  	#define PWM0LER_DISABLE			0									// Desbilita todos os registradores latchs do PWM
//	#define PWM0LER0_ENABLE			(1 << 0)							// Habilita o registrador latch do PWM0
//	#define PWM0LER1_ENABLE			(1 << 1)							// Habilita o registrador latch do PWM1
//	#define PWM0LER2_ENABLE			(1 << 2)							// Habilita o registrador latch do PWM2
//	#define PWM0LER3_ENABLE			(1 << 3)							// Habilita o registrador latch do PWM3
//	#define PWM0LER4_ENABLE			(1 << 4)							// Habilita o registrador latch do PWM4
//	#define PWM0LER5_ENABLE			(1 << 5)							// Habilita o registrador latch do PWM5
//	#define PWM0LER6_ENABLE			(1 << 6)							// Habilita o registrador latch do PWM6
//#define PWM0CTCR        (*(reg32 *)(PWM0_BASE_ADDR + 0x70))
//
//// ########################################################################################################################################
//// PWM1 - PULSE WIDTH MODULATOR
//#define PWM1_BASE_ADDR		0xE0018000
//
//#define PWM1IR          (*(reg32 *)(PWM1_BASE_ADDR + 0x00))			//  Interrupt Register
//	#define PW1MIR_MR0I  (1 << 0)            							// Flag de interrupção PWM0
//	#define PW1MIR_MR1I  (1 << 1)         						 		// Flag de interrupção PWM1
//	#define PW1MIR_MR2I  (1 << 2)    						       		// Flag de interrupção PWM2
//	#define PW1MIR_MR3I  (1 << 3)            							// Flag de interrupção PWM3
//	#define PW1MIR_MR4I  (1 << 8)            							// Flag de interrupção PWM4
//	#define PW1MIR_MR5I  (1 << 9)            							// Flag de interrupção PWM5
//	#define PW1MIR_MR6I  (1 << 10)           							// Flag de interrupção PWM6
//	#define PW1MIR_MASK  (0x070F)
//
//#define PWM1TCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x04))			// Timer Control Register
//#define PWM1TC          (*(reg32 *)(PWM1_BASE_ADDR + 0x08))         // Timer Counter
//#define PWM1PR          (*(reg32 *)(PWM1_BASE_ADDR + 0x0C))         // Prescale Register
//#define PWM1PC          (*(reg32 *)(PWM1_BASE_ADDR + 0x10))         // Prescale Counter Register
//#define PWM1MCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x14))        	// Match Control Register
//	#define PWM1MCR_ENABLE 		(1 << 0)								// Habilita o contador do timer PWM
//	#define PWM1MCR_RESET  		(1 << 1)								// Zera o contador do timer PWM
//	#define PWM1MCR_PWM_ENABLE  (1 << 3)
//
//#define PWM1MR0         (*(reg32 *)(PWM1_BASE_ADDR + 0x18))			// Match Register 0
//#define PWM1MR1         (*(reg32 *)(PWM1_BASE_ADDR + 0x1C))			// Match Register 1
//#define PWM1MR2         (*(reg32 *)(PWM1_BASE_ADDR + 0x20))			// Match Register 2
//#define PWM1MR3         (*(reg32 *)(PWM1_BASE_ADDR + 0x24))			// Match Register 3
//#define PWM1CCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x28))
//#define PWM1CR0         (*(reg32 *)(PWM1_BASE_ADDR + 0x2C))
//#define PWM1CR1         (*(reg32 *)(PWM1_BASE_ADDR + 0x30))
//#define PWM1CR2         (*(reg32 *)(PWM1_BASE_ADDR + 0x34))
//#define PWM1CR3         (*(reg32 *)(PWM1_BASE_ADDR + 0x38))
//#define PWM1EMR         (*(reg32 *)(PWM1_BASE_ADDR + 0x3C))
//#define PWM1MR4         (*(reg32 *)(PWM1_BASE_ADDR + 0x40))			// Match Register 4
//#define PWM1MR5         (*(reg32 *)(PWM1_BASE_ADDR + 0x44))			// Match Register 5
//#define PWM1MR6         (*(reg32 *)(PWM1_BASE_ADDR + 0x48))			// Match Register 6
//#define PWM1PCR         (*(reg32 *)(PWM1_BASE_ADDR + 0x4C))			// Control Register
//  	#define PWM1PCR_PWM_SEL2	(1 << 2)								// Seleciona o controle de dupla borda para o PWM2. 0 = borda simples / 1 = Dupla borda
//	#define PWM1PCR_PWM_SEL3	(1 << 3)								// Seleciona o controle de dupla borda para o PWM3. 0 = borda simples / 1 = Dupla borda
//	#define PWM1PCR_PWM_SEL4	(1 << 4)								// Seleciona o controle de dupla borda para o PWM4. 0 = borda simples / 1 = Dupla borda
//	#define PWM1PCR_PWM_SEL5	(1 << 5)								// Seleciona o controle de dupla borda para o PWM5. 0 = borda simples / 1 = Dupla borda
//	#define PWM1PCR_PWM_SEL6	(1 << 6)								// Seleciona o controle de dupla borda para o PWM6. 0 = borda simples / 1 = Dupla borda
//	#define PWM1PCR_PWM_ENABLE1	(1 << 9)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM1PCR_PWM_ENABLE2	(1 << 10)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM1PCR_PWM_ENABLE3	(1 << 11)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM1PCR_PWM_ENABLE4	(1 << 12)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM1PCR_PWM_ENABLE5	(1 << 13)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//	#define PWM1PCR_PWM_ENABLE6	(1 << 14)								// Habilita a saida do PWM para o pino. 0 = Não habilita / 1 = Habilita
//
//#define PWM1LER         (*(reg32 *)(PWM1_BASE_ADDR + 0x50))			// Latch Enable Register
//  	#define PWM1LER_DISABLE			0									// Desbilita todos os registradores latchs do PWM
//	#define PWM1LER0_ENABLE			(1 << 0)							// Habilita o registrador latch do PWM0
//	#define PWM1LER1_ENABLE			(1 << 1)							// Habilita o registrador latch do PWM1
//	#define PWM1LER2_ENABLE			(1 << 2)							// Habilita o registrador latch do PWM2
//	#define PWM1LER3_ENABLE			(1 << 3)							// Habilita o registrador latch do PWM3
//	#define PWM1LER4_ENABLE			(1 << 4)							// Habilita o registrador latch do PWM4
//	#define PWM1LER5_ENABLE			(1 << 5)							// Habilita o registrador latch do PWM5
//	#define PWM1LER6_ENABLE			(1 << 6)							// Habilita o registrador latch do PWM6
//
//#define PWM1CTCR        (*(reg32 *)(PWM1_BASE_ADDR + 0x70))
//
//
// ########################################################################################################################################
// UART0 - UNIVERSAL ASYNCHRONOUS RECEIVER TRANSMITTER
#define UART0_SIZE_FIFO	16

// Modos de trabalho das UARTs
#define UART0_8N1      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_NO   + U0LCR_STOP_1)
#define UART0_7N1      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_NO   + U0LCR_STOP_1)
#define UART0_8N2      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_NO   + U0LCR_STOP_2)
#define UART0_7N2      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_NO   + U0LCR_STOP_2)
#define UART0_8E1      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_EVEN + U0LCR_STOP_1)
#define UART0_7E1      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_EVEN + U0LCR_STOP_1)
#define UART0_8E2      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_EVEN + U0LCR_STOP_2)
#define UART0_7E2      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_EVEN + U0LCR_STOP_2)
#define UART0_8O1      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_ODD  + U0LCR_STOP_1)
#define UART0_7O1      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_ODD  + U0LCR_STOP_1)
#define UART0_8O2      (u8)(U0LCR_CHAR_8 + U0LCR_PAR_ODD  + U0LCR_STOP_2)
#define UART0_7O2      (u8)(U0LCR_CHAR_7 + U0LCR_PAR_ODD  + U0LCR_STOP_2)


// TIPO DE FIFO DAS UARTS
#define UART0_FIFO_OFF (0x00)
#define UART0_FIFO_RX_TRIG1   (u8)(U0FCR_FIFO_ENABLE + U0FCR_FIFO_TRIG1)
#define UART0_FIFO_RX_TRIG4   (u8)(U0FCR_FIFO_ENABLE + U0FCR_FIFO_TRIG4)
#define UART0_FIFO_RX_TRIG8   (u8)(U0FCR_FIFO_ENABLE + U0FCR_FIFO_TRIG8)
#define UART0_FIFO_RX_TRIG14  (u8)(U0FCR_FIFO_ENABLE + U0FCR_FIFO_TRIG14)

#define UART0_BASE_ADDR		0x4000C000
#define U0RBR          (*(reg32 *)(UART0_BASE_ADDR + 0x00))	// Registrador de recepção de dados
#define U0THR          (*(reg32 *)(UART0_BASE_ADDR + 0x00))	// Registrador de transmissão de dados
#define U0DLL          (*(reg32 *)(UART0_BASE_ADDR + 0x00))	// Registrador de ajuste de baudrate (LSB)
#define U0DLM          (*(reg32 *)(UART0_BASE_ADDR + 0x04))	// Registrador de ajuste de baudrate (MSB)
#define U0IER          (*(reg32 *)(UART0_BASE_ADDR + 0x04))	// Registrador de habilitação das interrupções
	#define U0IER_ERBFI          (1 << 0)    					// Habilita a int de dado pronto recebido
	#define U0IER_ETBEI          (1 << 1)    					// Habilita a int THRE (Transmit Holding Register Empty)
	#define U0IER_ELSI           (1 << 2)    					// Enable Receive Line Status Interrupt
	#define U0IER_EDSSI          (1 << 3)    					// Enable MODEM Status Interrupt

#define U0IIR          (*(reg32 *)(UART0_BASE_ADDR + 0x08))	// Registrador de ID de interrupção. Somente para leitura
	#define U0IIR_NO_INT         (1 << 0)   				 	// 1 = Sem pendencia de interrupção / 0 = Pelo menos uma pedencia de interrupção
	#define U0IIR_MS_INT         (0 << 1)    					// MODEM Status
	#define U0IIR_THRE_INT       (1 << 1)    					// Interrupção de THRE (Transmit Holding Register Empty)(
	#define U0IIR_RDA_INT        (2 << 1)    					// Dado disponivel na recpção
	#define U0IIR_RLS_INT        (3 << 1)    					// Receive Line Status
	#define U0IIR_CTI_INT        (6 << 1)    					// Indicador de estouro de tempo para o caractere (Character Timeout Indicator)
	#define U0IIR_ID_MASK        0x0E

#define U0FCR          (*(reg32 *)(UART0_BASE_ADDR + 0x08))	// Registrador de controle da FIFO
	#define U0FCR_FIFO_ENABLE    (1 << 0)    					// Habilita FIFO
	#define U0FCR_RX_FIFO_RESET  (1 << 1)    					// Reseta o FIFO de recepção
	#define U0FCR_TX_FIFO_RESET  (1 << 2)   			 		// Reseta o FIFO de transmissão
	#define U0FCR_FIFO_TRIG1     (0 << 6)    					// Trigger com 1 character in FIFO
	#define U0FCR_FIFO_TRIG4     (1 << 6)   			 		// Trigger com 4 characters in FIFO
	#define U0FCR_FIFO_TRIG8     (2 << 6)   				 	// Trigger com 8 characters in FIFO
	#define U0FCR_FIFO_TRIG14    (3 << 6)    					// Trigger com 14 characters in FIFO
//
#define U0LCR          (*(reg32 *)(UART0_BASE_ADDR + 0x0C))	// Registrador de controle de linha
	#define U0LCR_CHAR_5         (0 << 0)   			 		// Tamanho do caractere com 5 bits
	#define U0LCR_CHAR_6         (1 << 0)    					// Tamanho do caractere com 6 bits
	#define U0LCR_CHAR_7         (2 << 0)    					// Tamanho do caractere com 7 bits
	#define U0LCR_CHAR_8         (3 << 0)    					// Tamanho do caractere com 8 bits
	#define U0LCR_STOP_1         (0 << 2)    					// 1 stop bit
	#define U0LCR_STOP_2         (1 << 2)    					// 2 stop bits ou 1.5 se ULCR[1:0] = 00
	#define U0LCR_PAR_NO         (0 << 3)    					// Sem pariedade
	#define U0LCR_PAR_ODD        (1 << 3)    					// Pariedade impar
	#define U0LCR_PAR_EVEN       (3 << 3)    					// Pariedade par
	#define U0LCR_PAR_MARK       (5 << 3)    					// Força a pariedade = 1
	#define U0LCR_PAR_SPACE      (7 << 3)   	 				// Força a pariedade = 0
	#define U0LCR_BREAK_ENABLE   (1 << 6)    					// Condições de parada a linha de saida. 1 = Habilita parada de transmissão / 0 = Desabilita parada de transmissão
	#define U0LCR_DLAB_ENABLE    (1 << 7)    					// Acessos as registradores do baudrate

#define U0LSR          (*(reg32 *)(UART0_BASE_ADDR + 0x14))	// Registrador de status de linha
	#define U0LSR_RDR            (1 << 0)    					// Receive Data Ready
	#define U0LSR_OE             (1 << 1)    					// Overrun Error
	#define U0LSR_PE             (1 << 2)   			 		// Parity Error
	#define U0LSR_FE             (1 << 3)   	 				// Framing Error
	#define U0LSR_BI             (1 << 4)    					// Break Interrupt
	#define U0LSR_THRE           (1 << 5)    					// Transmit Holding Register Empty
	#define U0LSR_TEMT           (1 << 6)    					// Transmitter Empty
	#define U0LSR_RXFE           (1 << 7)    					// Error in Receive FIFO
	#define U0LSR_ERR_MASK       0x1E
//
#define U0SCR          (*(reg32 *)(UART0_BASE_ADDR + 0x1C))	// Scratch Pad Register
#define U0ACR          (*(reg32 *)(UART0_BASE_ADDR + 0x20))
#define U0FDR          (*(reg32 *)(UART0_BASE_ADDR + 0x28))
#define U0TER          (*(reg32 *)(UART0_BASE_ADDR + 0x30))

// ########################################################################################################################################
// UART1 - UNIVERSAL ASYNCHRONOUS RECEIVER TRANSMITTER

#define UART1_SIZE_FIFO	16

// Modos de trabalho das UARTs
#define UART1_8N1      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_NO   + U1LCR_STOP_1)
#define UART1_7N1      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_NO   + U1LCR_STOP_1)
#define UART1_8N2      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_NO   + U1LCR_STOP_2)
#define UART1_7N2      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_NO   + U1LCR_STOP_2)
#define UART1_8E1      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_EVEN + U1LCR_STOP_1)
#define UART1_7E1      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_EVEN + U1LCR_STOP_1)
#define UART1_8E2      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_EVEN + U1LCR_STOP_2)
#define UART1_7E2      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_EVEN + U1LCR_STOP_2)
#define UART1_8O1      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_ODD  + U1LCR_STOP_1)
#define UART1_7O1      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_ODD  + U1LCR_STOP_1)
#define UART1_8O2      (u8)(U1LCR_CHAR_8 + U1LCR_PAR_ODD  + U1LCR_STOP_2)
#define UART1_7O2      (u8)(U1LCR_CHAR_7 + U1LCR_PAR_ODD  + U1LCR_STOP_2)

// Tipo de FIFO das UARTs
#define UART1_FIFO_OFF (0x00)
#define UART1_FIFO_RX_TRIG1   (u8)(U1FCR_FIFO_ENABLE + U1FCR_FIFO_TRIG1)
#define UART1_FIFO_RX_TRIG4   (u8)(U1FCR_FIFO_ENABLE + U1FCR_FIFO_TRIG4)
#define UART1_FIFO_RX_TRIG8   (u8)(U1FCR_FIFO_ENABLE + U1FCR_FIFO_TRIG8)
#define UART1_FIFO_RX_TRIG14  (u8)(U1FCR_FIFO_ENABLE + U1FCR_FIFO_TRIG14)

#define UART1_BASE_ADDR		0x40010000
#define U1RBR          (*(reg32 *)(UART1_BASE_ADDR + 0x00))	// Registrador de recepção de dados
#define U1THR          (*(reg32 *)(UART1_BASE_ADDR + 0x00))	// Registrador de transmissão de dados
#define U1DLL          (*(reg32 *)(UART1_BASE_ADDR + 0x00))	// Registrador de ajuste de baudrate (LSB)
#define U1DLM          (*(reg32 *)(UART1_BASE_ADDR + 0x04))	// Registrador de ajuste de baudrate (MSB)
#define U1IER          (*(reg32 *)(UART1_BASE_ADDR + 0x04))	// Registrador de habilitação das interrupções
	#define U1IER_ERBFI          (1 << 0)    					// Habilita a int de dado pronto recebido
	#define U1IER_ETBEI          (1 << 1)    					// Habilita a int THRE (Transmit Holding Register Empty)
	#define U1IER_ELSI           (1 << 2)    					// Enable Receive Line Status Interrupt
	#define U1IER_EDSSI          (1 << 3)    					// Enable MODEM Status Interrupt

