andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define U1IIR          (*(reg32 *)(UART1_BASE_ADDR + 0x08))	// Registrador de ID de interrupção. Somente para leitura
	#define U1IIR_NO_INT         (1 << 0)   				 	// 1 = Sem pendencia de interrupção / 0 = Pelo menos uma pedencia de interrupção
	#define U1IIR_MS_INT         (0 << 1)    					// MODEM Status
	#define U1IIR_THRE_INT       (1 << 1)    					// Interrupção de THRE (Transmit Holding Register Empty)(
	#define U1IIR_RDA_INT        (2 << 1)    					// Dado disponivel na recpção
	#define U1IIR_RLS_INT        (3 << 1)    					// Receive Line Status
	#define U1IIR_CTI_INT        (6 << 1)    					// Indicador de estouro de tempo para o caractere (Character Timeout Indicator)
	#define U1IIR_ID_MASK        0x0E

#define U1FCR          (*(reg32 *)(UART1_BASE_ADDR + 0x08))	// Registrador de controle da FIFO
	#define U1FCR_FIFO_ENABLE    (1 << 0)    					// Habilita FIFO
	#define U1FCR_RX_FIFO_RESET  (1 << 1)    					// Reseta o FIFO de recepção
	#define U1FCR_TX_FIFO_RESET  (1 << 2)   			 		// Reseta o FIFO de transmissão
	#define U1FCR_FIFO_TRIG1     (0 << 6)    					// Trigger @ 1 character in FIFO
	#define U1FCR_FIFO_TRIG4     (1 << 6)   			 		// Trigger @ 4 characters in FIFO
	#define U1FCR_FIFO_TRIG8     (2 << 6)   				 	// Trigger @ 8 characters in FIFO
	#define U1FCR_FIFO_TRIG14    (3 << 6)    					// Trigger @ 14 characters in FIFO

#define U1LCR          (*(reg32 *)(UART1_BASE_ADDR + 0x0C))	// Registrador de controle de linha
	#define U1LCR_CHAR_5         (0 << 0)   			 		// Tamanho do caractere com 5 bits
	#define U1LCR_CHAR_6         (1 << 0)    					// Tamanho do caractere com 6 bits
	#define U1LCR_CHAR_7         (2 << 0)    					// Tamanho do caractere com 7 bits
	#define U1LCR_CHAR_8         (3 << 0)    					// Tamanho do caractere com 8 bits
	#define U1LCR_STOP_1         (0 << 2)    					// 1 stop bit
	#define U1LCR_STOP_2         (1 << 2)    					// 2 stop bits ou 1.5 se ULCR[1:0] = 00
	#define U1LCR_PAR_NO         (0 << 3)    					// Sem pariedade
	#define U1LCR_PAR_ODD        (1 << 3)    					// Pariedade impar
	#define U1LCR_PAR_EVEN       (3 << 3)    					// Pariedade par
	#define U1LCR_PAR_MARK       (5 << 3)    					// Força a pariedade = 1
	#define U1LCR_PAR_SPACE      (7 << 3)   	 				// Força a pariedade = 0
	#define U1LCR_BREAK_ENABLE   (1 << 6)    					// Condições de parada a linha de saida. 1 = Habilita parada de transmissão / 0 = Desabilita parada de transmissão
	#define U1LCR_DLAB_ENABLE    (1 << 7)    					// Acessos as registradores do baudrate

#define U1MCR          (*(reg32 *)(UART1_BASE_ADDR + 0x10))
	#define U1MCR_DTR            (1 << 0)    		// Data Terminal Ready
	#define U1MCR_RTS            (1 << 1)    		// Request To Send
	#define U1MCR_LB             (1 << 4)    		// Loopback

#define U1LSR          (*(reg32 *)(UART1_BASE_ADDR + 0x14))	// Registrador de status de linha
	#define U1LSR_RDR            (1 << 0)    					// Receive Data Ready
	#define U1LSR_OE             (1 << 1)    					// Overrun Error
	#define U1LSR_PE             (1 << 2)   			 		// Parity Error
	#define U1LSR_FE             (1 << 3)   	 				// Framing Error
	#define U1LSR_BI             (1 << 4)    					// Break Interrupt
	#define U1LSR_THRE           (1 << 5)    					// Transmit Holding Register Empty
	#define U1LSR_TEMT           (1 << 6)    					// Transmitter Empty
	#define U1LSR_RXFE           (1 << 7)    					// Error in Receive FIFO
	#define U1LSR_ERR_MASK       0x1E

#define U1MSR          (*(reg32 *)(UART1_BASE_ADDR + 0x18))
	#define U1MSR_DCTS           (1 << 0)    		// Delta Clear To Send
	#define U1MSR_DDSR           (1 << 1)    		// Delta Data Set Ready
	#define U1MSR_TERI           (1 << 2)    		// Trailing Edge Ring Indicator
	#define U1MSR_DDCD           (1 << 3)    		// Delta Data Carrier Detect
	#define U1MSR_CTS            (1 << 4)    		// Clear To Send
	#define U1MSR_DSR            (1 << 5)    		// Data Set Ready
	#define U1MSR_RI             (1 << 6)  			// Ring Indicator
	#define U1MSR_DCD            (1 << 7)    		// Data Carrier Detect

#define U1SCR          (*(reg32 *)(UART1_BASE_ADDR + 0x1C)) // Scratch Pad Register
#define U1ACR          (*(reg32 *)(UART1_BASE_ADDR + 0x20))
#define U1FDR          (*(reg32 *)(UART1_BASE_ADDR + 0x28))
#define U1TER          (*(reg32 *)(UART1_BASE_ADDR + 0x30))

// ########################################################################################################################################
// UART2 - UNIVERSAL ASYNCHRONOUS RECEIVER TRANSMITTER

#define UART2_SIZE_FIFO	16

// Modos de trabalho das UARTs
#define UART2_8N1      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_NO   + U2LCR_STOP_1)
#define UART2_7N1      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_NO   + U2LCR_STOP_1)
#define UART2_8N2      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_NO   + U2LCR_STOP_2)
#define UART2_7N2      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_NO   + U2LCR_STOP_2)
#define UART2_8E1      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_EVEN + U2LCR_STOP_1)
#define UART2_7E1      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_EVEN + U2LCR_STOP_1)
#define UART2_8E2      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_EVEN + U2LCR_STOP_2)
#define UART2_7E2      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_EVEN + U2LCR_STOP_2)
#define UART2_8O1      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_ODD  + U2LCR_STOP_1)
#define UART2_7O1      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_ODD  + U2LCR_STOP_1)
#define UART2_8O2      (u8)(U2LCR_CHAR_8 + U2LCR_PAR_ODD  + U2LCR_STOP_2)
#define UART2_7O2      (u8)(U2LCR_CHAR_7 + U2LCR_PAR_ODD  + U2LCR_STOP_2)

// Tipo de FIFO das UARTs
#define UART2_FIFO_OFF (0x00)
#define UART2_FIFO_RX_TRIG1   (u8)(U2FCR_FIFO_ENABLE + U2FCR_FIFO_TRIG1)
#define UART2_FIFO_RX_TRIG4   (u8)(U2FCR_FIFO_ENABLE + U2FCR_FIFO_TRIG4)
#define UART2_FIFO_RX_TRIG8   (u8)(U2FCR_FIFO_ENABLE + U2FCR_FIFO_TRIG8)
#define UART2_FIFO_RX_TRIG14  (u8)(U2FCR_FIFO_ENABLE + U2FCR_FIFO_TRIG14)

#define UART2_BASE_ADDR		0x40098000
#define U2RBR          (*(reg32 *)(UART2_BASE_ADDR + 0x00))	// Registrador de recepção de dados
#define U2THR          (*(reg32 *)(UART2_BASE_ADDR + 0x00))	// Registrador de transmissão de dados
#define U2DLL          (*(reg32 *)(UART2_BASE_ADDR + 0x00))	// Registrador de ajuste de baudrate (LSB)
#define U2DLM          (*(reg32 *)(UART2_BASE_ADDR + 0x04))	// Registrador de ajuste de baudrate (MSB)
#define U2IER          (*(reg32 *)(UART2_BASE_ADDR + 0x04))	// Registrador de habilitação das interrupções
	#define U2IER_ERBFI          (1 << 0)    					// Habilita a int de dado pronto recebido
	#define U2IER_ETBEI          (1 << 1)    					// Habilita a int THRE (Transmit Holding Register Empty)
	#define U2IER_ELSI           (1 << 2)    					// Enable Receive Line Status Interrupt
	#define U2IER_EDSSI          (1 << 3)    					// Enable MODEM Status Interrupt

