andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define U2IIR          (*(reg32 *)(UART2_BASE_ADDR + 0x08))	// Registrador de ID de interrupção. Somente para leitura
	#define U2IIR_NO_INT         (1 << 0)   				 	// 1 = Sem pendencia de interrupção / 0 = Pelo menos uma pedencia de interrupção
	#define U2IIR_MS_INT         (0 << 1)    					// MODEM Status
	#define U2IIR_THRE_INT       (1 << 1)    					// Interrupção de THRE (Transmit Holding Register Empty)(
	#define U2IIR_RDA_INT        (2 << 1)    					// Dado disponivel na recpção
	#define U2IIR_RLS_INT        (3 << 1)    					// Receive Line Status
	#define U2IIR_CTI_INT        (6 << 1)    					// Indicador de estouro de tempo para o caractere (Character Timeout Indicator)
	#define U2IIR_ID_MASK        0x0E

#define U2FCR          (*(reg32 *)(UART2_BASE_ADDR + 0x08))		// Registrador de controle da FIFO
	#define U2FCR_FIFO_ENABLE    (1 << 0)    					// Habilita FIFO
	#define U2FCR_RX_FIFO_RESET  (1 << 1)    					// Reseta o FIFO de recepção
	#define U2FCR_TX_FIFO_RESET  (1 << 2)   			 		// Reseta o FIFO de transmissão
	#define U2FCR_FIFO_TRIG1     (0 << 6)    					// Trigger @ 1 character in FIFO
	#define U2FCR_FIFO_TRIG4     (1 << 6)   			 		// Trigger @ 4 characters in FIFO
	#define U2FCR_FIFO_TRIG8     (2 << 6)   				 	// Trigger @ 8 characters in FIFO
	#define U2FCR_FIFO_TRIG14    (3 << 6)    					// Trigger @ 14 characters in FIFO

#define U2LCR          (*(reg32 *)(UART2_BASE_ADDR + 0x0C))	// Registrador de controle de linha
	#define U2LCR_CHAR_5         (0 << 0)   			 		// Tamanho do caractere com 5 bits
	#define U2LCR_CHAR_6         (1 << 0)    					// Tamanho do caractere com 6 bits
	#define U2LCR_CHAR_7         (2 << 0)    					// Tamanho do caractere com 7 bits
	#define U2LCR_CHAR_8         (3 << 0)    					// Tamanho do caractere com 8 bits
	#define U2LCR_STOP_1         (0 << 2)    					// 1 stop bit
	#define U2LCR_STOP_2         (1 << 2)    					// 2 stop bits ou 1.5 se ULCR[1:0] = 00
	#define U2LCR_PAR_NO         (0 << 3)    					// Sem pariedade
	#define U2LCR_PAR_ODD        (1 << 3)    					// Pariedade impar
	#define U2LCR_PAR_EVEN       (3 << 3)    					// Pariedade par
	#define U2LCR_PAR_MARK       (5 << 3)    					// Força a pariedade = 1
	#define U2LCR_PAR_SPACE      (7 << 3)   	 				// Força a pariedade = 0
	#define U2LCR_BREAK_ENABLE   (1 << 6)    					// Condições de parada a linha de saida. 1 = Habilita parada de transmissão / 0 = Desabilita parada de transmissão
	#define U2LCR_DLAB_ENABLE    (1 << 7)    					// Acessos as registradores do baudrate

#define U2LSR          (*(reg32 *)(UART2_BASE_ADDR + 0x14))	// Registrador de status de linha
	#define U2LSR_RDR            (1 << 0)    					// Receive Data Ready
	#define U2LSR_OE             (1 << 1)    					// Overrun Error
	#define U2LSR_PE             (1 << 2)   			 		// Parity Error
	#define U2LSR_FE             (1 << 3)   	 				// Framing Error
	#define U2LSR_BI             (1 << 4)    					// Break Interrupt
	#define U2LSR_THRE           (1 << 5)    					// Transmit Holding Register Empty
	#define U2LSR_TEMT           (1 << 6)    					// Transmitter Empty
	#define U2LSR_RXFE           (1 << 7)    					// Error in Receive FIFO
	#define U2LSR_ERR_MASK       0x1E

#define U2SCR          (*(reg32 *)(UART2_BASE_ADDR + 0x1C))
#define U2ACR          (*(reg32 *)(UART2_BASE_ADDR + 0x20))
#define U2FDR          (*(reg32 *)(UART2_BASE_ADDR + 0x28))
#define U2TER          (*(reg32 *)(UART2_BASE_ADDR + 0x30))

// ########################################################################################################################################
// UART3 - UNIVERSAL ASYNCHRONOUS RECEIVER TRANSMITTER

#define UART3_SIZE_FIFO	16

// Modos de trabalho das UARTs
#define UART3_8N1      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_NO   + U3LCR_STOP_1)
#define UART3_7N1      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_NO   + U3LCR_STOP_1)
#define UART3_8N2      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_NO   + U3LCR_STOP_2)
#define UART3_7N2      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_NO   + U3LCR_STOP_2)
#define UART3_8E1      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_EVEN + U3LCR_STOP_1)
#define UART3_7E1      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_EVEN + U3LCR_STOP_1)
#define UART3_8E2      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_EVEN + U3LCR_STOP_2)
#define UART3_7E2      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_EVEN + U3LCR_STOP_2)
#define UART3_8O1      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_ODD  + U3LCR_STOP_1)
#define UART3_7O1      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_ODD  + U3LCR_STOP_1)
#define UART3_8O2      (u8)(U3LCR_CHAR_8 + U3LCR_PAR_ODD  + U3LCR_STOP_2)
#define UART3_7O2      (u8)(U3LCR_CHAR_7 + U3LCR_PAR_ODD  + U3LCR_STOP_2)

// Tipo de FIFO das UARTs
#define UART3_FIFO_OFF (0x00)
#define UART3_FIFO_RX_TRIG1   (u8)(U3FCR_FIFO_ENABLE + U3FCR_FIFO_TRIG1)
#define UART3_FIFO_RX_TRIG4   (u8)(U3FCR_FIFO_ENABLE + U3FCR_FIFO_TRIG4)
#define UART3_FIFO_RX_TRIG8   (u8)(U3FCR_FIFO_ENABLE + U3FCR_FIFO_TRIG8)
#define UART3_FIFO_RX_TRIG14  (u8)(U3FCR_FIFO_ENABLE + U3FCR_FIFO_TRIG14)

#define UART3_BASE_ADDR		0x4009C000
#define U3RBR          (*(reg32 *)(UART3_BASE_ADDR + 0x00))	// Registrador de recepção de dados
#define U3THR          (*(reg32 *)(UART3_BASE_ADDR + 0x00))	// Registrador de transmissão de dados
#define U3DLL          (*(reg32 *)(UART3_BASE_ADDR + 0x00))	// Registrador de ajuste de baudrate (LSB)
#define U3DLM          (*(reg32 *)(UART3_BASE_ADDR + 0x04))	// Registrador de ajuste de baudrate (MSB)
#define U3IER          (*(reg32 *)(UART3_BASE_ADDR + 0x04))	// Registrador de habilitação das interrupções
	#define U3IER_ERBFI          (1 << 0)    					// Habilita a int de dado pronto recebido
	#define U3IER_ETBEI          (1 << 1)    					// Habilita a int THRE (Transmit Holding Register Empty)
	#define U3IER_ELSI           (1 << 2)    					// Enable Receive Line Status Interrupt
	#define U3IER_EDSSI          (1 << 3)    					// Enable MODEM Status Interrupt

#define U3IIR          (*(reg32 *)(UART3_BASE_ADDR + 0x08))	// Registrador de ID de interrupção. Somente para leitura
	#define U3IIR_NO_INT         (1 << 0)   				 	// 1 = Sem pendencia de interrupção / 0 = Pelo menos uma pedencia de interrupção
	#define U3IIR_MS_INT         (0 << 1)    					// MODEM Status
	#define U3IIR_THRE_INT       (1 << 1)    					// Interrupção de THRE (Transmit Holding Register Empty)(
	#define U3IIR_RDA_INT        (2 << 1)    					// Dado disponivel na recpção
	#define U3IIR_RLS_INT        (3 << 1)    					// Receive Line Status
	#define U3IIR_CTI_INT        (6 << 1)    					// Indicador de estouro de tempo para o caractere (Character Timeout Indicator)
	#define U3IIR_ID_MASK        0x0E

#define U3FCR          (*(reg32 *)(UART3_BASE_ADDR + 0x08))	// Registrador de controle da FIFO
	#define U3FCR_FIFO_ENABLE    (1 << 0)    					// Habilita FIFO
	#define U3FCR_RX_FIFO_RESET  (1 << 1)    					// Reseta o FIFO de recepção
	#define U3FCR_TX_FIFO_RESET  (1 << 2)   			 		// Reseta o FIFO de transmissão
	#define U3FCR_FIFO_TRIG1     (0 << 6)    					// Trigger @ 1 character in FIFO
	#define U3FCR_FIFO_TRIG4     (1 << 6)   			 		// Trigger @ 4 characters in FIFO
	#define U3FCR_FIFO_TRIG8     (2 << 6)   				 	// Trigger @ 8 characters in FIFO
	#define U3FCR_FIFO_TRIG14    (3 << 6)    					// Trigger @ 14 characters in FIFO

