andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define U3LCR          (*(reg32 *)(UART3_BASE_ADDR + 0x0C))	// Registrador de controle de linha
	#define U3LCR_CHAR_5         (0 << 0)   			 		// Tamanho do caractere com 5 bits
	#define U3LCR_CHAR_6         (1 << 0)    					// Tamanho do caractere com 6 bits
	#define U3LCR_CHAR_7         (2 << 0)    					// Tamanho do caractere com 7 bits
	#define U3LCR_CHAR_8         (3 << 0)    					// Tamanho do caractere com 8 bits
	#define U3LCR_STOP_1         (0 << 2)    					// 1 stop bit
	#define U3LCR_STOP_2         (1 << 2)    					// 2 stop bits ou 1.5 se ULCR[1:0] = 00
	#define U3LCR_PAR_NO         (0 << 3)    					// Sem pariedade
	#define U3LCR_PAR_ODD        (1 << 3)    					// Pariedade impar
	#define U3LCR_PAR_EVEN       (3 << 3)    					// Pariedade par
	#define U3LCR_PAR_MARK       (5 << 3)    					// Força a pariedade = 1
	#define U3LCR_PAR_SPACE      (7 << 3)   	 				// Força a pariedade = 0
	#define U3LCR_BREAK_ENABLE   (1 << 6)    					// Condições de parada a linha de saida. 1 = Habilita parada de transmissão / 0 = Desabilita parada de transmissão
	#define U3LCR_DLAB_ENABLE    (1 << 7)    					// Acessos as registradores do baudrate

#define U3LSR          (*(reg32 *)(UART3_BASE_ADDR + 0x14))	// Registrador de status de linha
	#define U3LSR_RDR            (1 << 0)    					// Receive Data Ready
	#define U3LSR_OE             (1 << 1)    					// Overrun Error
	#define U3LSR_PE             (1 << 2)   			 		// Parity Error
	#define U3LSR_FE             (1 << 3)   	 				// Framing Error
	#define U3LSR_BI             (1 << 4)    					// Break Interrupt
	#define U3LSR_THRE           (1 << 5)    					// Transmit Holding Register Empty
	#define U3LSR_TEMT           (1 << 6)    					// Transmitter Empty
	#define U3LSR_RXFE           (1 << 7)    					// Error in Receive FIFO
	#define U3LSR_ERR_MASK       0x1E

#define U3SCR          (*(reg32 *)(UART3_BASE_ADDR + 0x1C))
#define U3ACR          (*(reg32 *)(UART3_BASE_ADDR + 0x20))
#define U3FDR          (*(reg32 *)(UART3_BASE_ADDR + 0x28))
#define U3TER          (*(reg32 *)(UART3_BASE_ADDR + 0x30))
//
//// ########################################################################################################################################
//// I2C0
//#define I2C0_BASE_ADDR		0xE001C000
//
//#define I2C0CONSET      (*(reg32 *)(I2C0_BASE_ADDR + 0x00))	// Control Set Register
//	#define I2C0_AA				(1 << 2) 						// ACK - Este bit em 1 envia um ACK em 1. bit 0 não tem efeito
//  	#define I2C0_SI				(1 << 3) 						// Flag de interrupção - Este bit em 1 indica que ocorreu interrupção
//  	#define I2C0_STO			(1 << 4) 						// Este bit em 1 envia stop. bit 0 não tem efeito
//  	#define I2C0_STA			(1 << 5) 						// Este bit em 1 envia start. bit 0 não tem efeito
//  	#define I2C0_I2EN			(1 << 6) 						// Este bit em 1 habilita bus I2C. bit 0 não tem efeito
//
//#define I2C0STAT        (*(reg32 *)(I2C0_BASE_ADDR + 0x04))	// Status Register
//  	// MESTRE - TRANSMISSÃO
//	#define I2C0_MT_SLA_ACK					0x18
//	#define I2C0_MT_SLA_NACK				0x20
//	#define I2C0_MT_DATA_ACK				0x28
//	#define I2C0_MT_DATA_NACK				0x30
//	#define I2C0_MT_ARB_LOST				0x38
//
//	// MESTRE - RECEPÇÃO
//	#define I2C0_MR_ARB_LOST				0x38
//	#define I2C0_MR_SLA_ACK					0x40
//	#define I2C0_MR_SLA_NACK				0x48
//	#define I2C0_MR_DATA_ACK				0x50
//	#define I2C0_MR_DATA_NACK				0x58
//
//	// ESCRAVO Slave - TRANSMISSÃO
//	#define I2C0_ST_SLA_ACK					0xA8
//	#define I2C0_ST_ARB_LOST_SLA_ACK		0xB0
//	#define I2C0_ST_DATA_ACK				0xB8
//	#define I2C0_ST_DATA_NACK				0xC0
//	#define I2C0_ST_LAST_DATA				0xC8
//
//	// ESCRAVO - RECEPÇÃO
//	#define I2C0_SR_SLA_ACK					0x60
//	#define I2C0_SR_ARB_LOST_SLA_ACK		0x68
//	#define I2C0_SR_GCALL_ACK				0x70
//	#define I2C0_SR_ARB_LOST_GCALL_ACK		0x78
//	#define I2C0_SR_DATA_ACK				0x80
//	#define I2C0_SR_DATA_NACK				0x88
//	#define I2C0_SR_GCALL_DATA_ACK			0x90
//	#define I2C0_SR_GCALL_DATA_NACK			0x98
//	#define I2C0_SR_STOP					0xA0
//
//#define I2C0DAT         (*(reg32 *)(I2C0_BASE_ADDR + 0x08))	// Data Register
//#define I2C0ADR         (*(reg32 *)(I2C0_BASE_ADDR + 0x0C))	// Slave Address Register
//#define I2C0SCLH        (*(reg32 *)(I2C0_BASE_ADDR + 0x10))	// SCL Duty Cycle Register (high half word)
//#define I2C0SCLL        (*(reg32 *)(I2C0_BASE_ADDR + 0x14))	// SCL Duty Cycle Register (low half word)
//#define I2C0CONCLR     	(*(reg32 *)(I2C0_BASE_ADDR + 0x18))  // Control Clear Register
//	#define I2C0_AAC				(1 << 2) 					// ACK - Este bit em 1 envia um ACK em 0. bit 0 não tem efeito
//  	#define I2C0_SIC				(1 << 3) 					// Flag de interrupção - Este bit em 1 limpa o flag de interrupção
//  	#define I2C0_STAC				(1 << 5) 					// Este bit em 1 encerra o start. bit 0 não tem efeito
//  	#define I2C0_I2ENC				(1 << 6) 					// Este bit em 1 desabilita bus I2C. bit 0 não tem efeito
//
//
//// ########################################################################################################################################
//// I2C1
//#define I2C1_BASE_ADDR		0xE005C000
//#define I2C1CONSET      (*(reg32 *)(I2C1_BASE_ADDR + 0x00))
//	#define I2C1_AA				(1 << 2) 						// ACK - Este bit em 1 envia um ACK em 1. bit 0 não tem efeito
//  	#define I2C1_SI				(1 << 3) 						// Flag de interrupção - Este bit em 1 indica que ocorreu interrupção
//  	#define I2C1_STO			(1 << 4) 						// Este bit em 1 envia stop. bit 0 não tem efeito
//  	#define I2C1_STA			(1 << 5) 						// Este bit em 1 envia start. bit 0 não tem efeito
//  	#define I2C1_I2EN			(1 << 6) 						// Este bit em 1 habilita bus I2C. bit 0 não tem efeito
//#define I2C1STAT        (*(reg32 *)(I2C1_BASE_ADDR + 0x04))
//	// MESTRE - TRANSMISSÃO
//	#define I2C1_MT_SLA_ACK					0x18
//	#define I2C1_MT_SLA_NACK				0x20
//	#define I2C1_MT_DATA_ACK				0x28
//	#define I2C1_MT_DATA_NACK				0x30
//	#define I2C1_MT_ARB_LOST				0x38
//
//	// MESTRE - RECEPÇÃO
//	#define I2C1_MR_ARB_LOST				0x38
//	#define I2C1_MR_SLA_ACK					0x40
//	#define I2C1_MR_SLA_NACK				0x48
//	#define I2C1_MR_DATA_ACK				0x50
//	#define I2C1_MR_DATA_NACK				0x58
//
//	// ESCRAVO Slave - TRANSMISSÃO
//	#define I2C1_ST_SLA_ACK					0xA8
//	#define I2C1_ST_ARB_LOST_SLA_ACK		0xB0
//	#define I2C1_ST_DATA_ACK				0xB8
//	#define I2C1_ST_DATA_NACK				0xC0
//	#define I2C1_ST_LAST_DATA				0xC8
//
//	// ESCRAVO - RECEPÇÃO
//	#define I2C1_SR_SLA_ACK					0x60
//	#define I2C1_SR_ARB_LOST_SLA_ACK		0x68
//	#define I2C1_SR_GCALL_ACK				0x70
//	#define I2C1_SR_ARB_LOST_GCALL_ACK		0x78
//	#define I2C1_SR_DATA_ACK				0x80
//	#define I2C1_SR_DATA_NACK				0x88
//	#define I2C1_SR_GCALL_DATA_ACK			0x90
//	#define I2C1_SR_GCALL_DATA_NACK			0x98
//	#define I2C1_SR_STOP					0xA0
//
//#define I2C1DAT         (*(reg32 *)(I2C1_BASE_ADDR + 0x08))
//#define I2C1ADR         (*(reg32 *)(I2C1_BASE_ADDR + 0x0C))
//#define I2C1SCLH        (*(reg32 *)(I2C1_BASE_ADDR + 0x10))
//#define I2C1SCLL        (*(reg32 *)(I2C1_BASE_ADDR + 0x14))
//#define I2C1CONCLR      (*(reg32 *)(I2C1_BASE_ADDR + 0x18))
//	#define I2C1_AAC				(1 << 2) 					// ACK - Este bit em 1 envia um ACK em 0. bit 0 não tem efeito
//  	#define I2C1_SIC				(1 << 3) 					// Flag de interrupção - Este bit em 1 limpa o flag de interrupção
//  	#define I2C1_STAC				(1 << 5) 					// Este bit em 1 encerra o start. bit 0 não tem efeito
//  	#define I2C1_I2ENC				(1 << 6) 					// Este bit em 1 desabilita bus I2C. bit 0 não tem efeito
//
//
//// ########################################################################################################################################
//// I2C2
//#define I2C2_BASE_ADDR		0xE0080000
//#define I2C2CONSET      (*(reg32 *)(I2C2_BASE_ADDR + 0x00))
//	#define I2C2_AA				(1 << 2) 						// ACK - Este bit em 1 envia um ACK em 1. bit 0 não tem efeito
//  	#define I2C2_SI				(1 << 3) 						// Flag de interrupção - Este bit em 1 indica que ocorreu interrupção
//  	#define I2C2_STO			(1 << 4) 						// Este bit em 1 envia stop. bit 0 não tem efeito
//  	#define I2C2_STA			(1 << 5) 						// Este bit em 1 envia start. bit 0 não tem efeito
//  	#define I2C2_I2EN			(1 << 6) 						// Este bit em 1 habilita bus I2C. bit 0 não tem efeito
//
//#define I2C2STAT        (*(reg32 *)(I2C2_BASE_ADDR + 0x04))
//  	// MESTRE - TRANSMISSÃO
//	#define I2C2_MT_SLA_ACK					0x18
//	#define I2C2_MT_SLA_NACK				0x20
//	#define I2C2_MT_DATA_ACK				0x28
//	#define I2C2_MT_DATA_NACK				0x30
//	#define I2C2_MT_ARB_LOST				0x38
//
//	// MESTRE - RECEPÇÃO
//	#define I2C2_MR_ARB_LOST				0x38
//	#define I2C2_MR_SLA_ACK					0x40
//	#define I2C2_MR_SLA_NACK				0x48
//	#define I2C2_MR_DATA_ACK				0x50
//	#define I2C2_MR_DATA_NACK				0x58
//
//	// ESCRAVO Slave - TRANSMISSÃO
//	#define I2C2_ST_SLA_ACK					0xA8
//	#define I2C2_ST_ARB_LOST_SLA_ACK		0xB0
//	#define I2C2_ST_DATA_ACK				0xB8
//	#define I2C2_ST_DATA_NACK				0xC0
//	#define I2C2_ST_LAST_DATA				0xC8
//
//	// ESCRAVO - RECEPÇÃO
//	#define I2C2_SR_SLA_ACK					0x60
//	#define I2C2_SR_ARB_LOST_SLA_ACK		0x68
//	#define I2C2_SR_GCALL_ACK				0x70
//	#define I2C2_SR_ARB_LOST_GCALL_ACK		0x78
//	#define I2C2_SR_DATA_ACK				0x80
//	#define I2C2_SR_DATA_NACK				0x88
//	#define I2C2_SR_GCALL_DATA_ACK			0x90
//	#define I2C2_SR_GCALL_DATA_NACK			0x98
//	#define I2C2_SR_STOP					0xA0
//
//#define I2C2DAT         (*(reg32 *)(I2C2_BASE_ADDR + 0x08))
//#define I2C2ADR         (*(reg32 *)(I2C2_BASE_ADDR + 0x0C))
//#define I2C2SCLH        (*(reg32 *)(I2C2_BASE_ADDR + 0x10))
//#define I2C2SCLL        (*(reg32 *)(I2C2_BASE_ADDR + 0x14))
//#define I2C2CONCLR      (*(reg32 *)(I2C2_BASE_ADDR + 0x18))
//	#define I2C2_AAC				(1 << 2) 					// ACK - Este bit em 1 envia um ACK em 0. bit 0 não tem efeito
//  	#define I2C2_SIC				(1 << 3) 					// Flag de interrupção - Este bit em 1 limpa o flag de interrupção
//  	#define I2C2_STAC				(1 << 5) 					// Este bit em 1 encerra o start. bit 0 não tem efeito
//  	#define I2C2_I2ENC				(1 << 6) 					// Este bit em 1 desabilita bus I2C. bit 0 não tem efeito


// ########################################################################################################################################
// SSP0
#define SSP0_FIFO_DEPTH  (8)

#define SSP0_BASE_ADDR		0x40088000
#define SSP0CR0        (*(reg32 *)(SSP0_BASE_ADDR + 0x00))
	#define SSP0_DSS_4   (0x3)	// 4 bits de transferencia
	#define SSP0_DSS_5   (0x4)	// 5 bits de transferencia
	#define SSP0_DSS_6   (0x5)	// 6 bits de transferencia
	#define SSP0_DSS_7   (0x6)	// 7 bits de transferencia
	#define SSP0_DSS_8   (0x7)	// 8 bits de transferencia
	#define SSP0_DSS_9   (0x8)	// 9 bits de transferencia
	#define SSP0_DSS_10  (0x9)	// 10 bits de transferencia
	#define SSP0_DSS_11  (0xa)	// 11 bits de transferencia
	#define SSP0_DSS_12  (0xb)	// 12 bits de transferencia
	#define SSP0_DSS_13  (0xc)	// 13 bits de transferencia
	#define SSP0_DSS_14  (0xd)	// 14 bits de transferencia
	#define SSP0_DSS_15  (0xe)	// 15 bits de transferencia
	#define SSP0_DSS_16  (0xf)	// 16 bits de transferencia
		#define SSP0_DSS_MASK (0xf)
	#define SSP0_FRF_SPI (0x0)	// Formato frame = SPI
	#define SSP0_FRF_SSI (0x10)	// Formato frame = TI
	#define SSP0_FRF_MW  (0x20)	// Formato frame = Microwire
	#define SSP0_STANDARD (0x7)

#define SSP0CR1        (*(reg32 *)(SSP0_BASE_ADDR + 0x04))
	#define SSP0_LBM_NORMAL    	(0x0)	// Loop back mode normal operation
	#define SSP0_LBM_SOUT    	(0x1)	// Loop back mode pego da saida MISO ou MOSI
	#define SSP0_SSE_OFF   		(0x0)	// SSP enable. O controlador SSP é desabilitado
	#define SSP0_SSE_ON    		(0x2)	// SSP enable. O controlador SSP interage com outros dispositivos seriais
	#define SSP0_MASTER    		(0x0) 	// SSP como mestre
	#define SSP0_SLAVE     		(0x4)	// SSP como escravo
	#define SSP0_SOD     		(0x8)	// Somente usados para modo escravo.

#define SSP0DR         (*(reg32 *)(SSP0_BASE_ADDR + 0x08)) // Regitrador de leitura e escrita dados transferidos no barramento SPP

#define SSP0SR         (*(reg32 *)(SSP0_BASE_ADDR + 0x0C)) // Registrador de estatus
	#define SSP0_TFE      (0x00000001)	// 1 = FIFO TX = vazio
	#define SSP0_TNF      (0x00000002)	// 1 = FIFO TX não está cheio. 0 = FIFO TX está cheio
	#define SSP0_RNE      (0x00000004)	// 0 = FIFO RX está vazio
	#define SSP0_RFF      (0x00000008)	// 1 = FIFO RX não está cheio
	#define SSP0_BSY      (0x00000010)	// 0 = BUS oscioso. 1 = BUS TX ou RX

