andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define SSP0CPSR       (*(reg32 *)(SSP0_BASE_ADDR + 0x10))

#define SSP0IMSC       (*(reg32 *)(SSP0_BASE_ADDR + 0x14))
	#define SSP0_RORIM  (0x1)
	#define SSP0_RTIM   (0x2)
	#define SSP0_RXIM   (0x4)
	#define SSP0_TXIM   (0x8)

#define SSP0RIS        (*(reg32 *)(SSP0_BASE_ADDR + 0x18))
	#define SSP0_RORRIS  (0x00000001)
	#define SSP0_RTRIS   (0x00000002)
	#define SSP0_RXRIS   (0x00000004)
	#define SSP0_TXRIS   (0x00000008)

#define SSP0MIS        (*(reg32 *)(SSP0_BASE_ADDR + 0x1C))
	#define SSP0_RORMIS  (0x00000001)
	#define SSP0_RTMIS   (0x00000002)
	#define SSP0_RXMIS   (0x00000004)
	#define SSP0_TXMIS   (0x00000008)

#define SSP0ICR        (*(reg32 *)(SSP0_BASE_ADDR + 0x20))
	#define SSP0_RORIC   (0x00000001)
	#define SSP0_RTIC    (0x00000002)

#define SSP0DMACR      (*(reg32 *)(SSP0_BASE_ADDR + 0x24))

// ########################################################################################################################################
// SSP1 Controller
#define SSP1_FIFO_DEPTH  (8)

#define SSP1_BASE_ADDR		0x40030000
#define SSP1CR0        (*(reg32 *)(SSP1_BASE_ADDR + 0x00))
	#define SSP1_DSS_4   (0x3)	// 4 bits de transferencia
	#define SSP1_DSS_5   (0x4)	// 5 bits de transferencia
	#define SSP1_DSS_6   (0x5)	// 6 bits de transferencia
	#define SSP1_DSS_7   (0x6)	// 7 bits de transferencia
	#define SSP1_DSS_8   (0x7)	// 8 bits de transferencia
	#define SSP1_DSS_9   (0x8)	// 9 bits de transferencia
	#define SSP1_DSS_10  (0x9)	// 10 bits de transferencia
	#define SSP1_DSS_11  (0xa)	// 11 bits de transferencia
	#define SSP1_DSS_12  (0xb)	// 12 bits de transferencia
	#define SSP1_DSS_13  (0xc)	// 13 bits de transferencia
	#define SSP1_DSS_14  (0xd)	// 14 bits de transferencia
	#define SSP1_DSS_15  (0xe)	// 15 bits de transferencia
	#define SSP1_DSS_16  (0xf)	// 16 bits de transferencia
		#define SSP1_DSS_MASK (0xf)
	#define SSP1_FRF_SPI (0x0)	// Formato frame = SPI
	#define SSP1_FRF_SSI (0x10)	// Formato frame = TI
	#define SSP1_FRF_MW  (0x20)	// Formato frame = Microwire
	#define SSP1_CPOL_L  (0)	// Clock em baixa entre os frames
	#define SSP1_CPOL_H  (1<<6)	// Clock em alta entre os frames
	#define SSP1_CPHA_L  (0)	// Dados capturados a partir do primeiro clock
	#define SSP1_CPHA_H  (1<<7)	// Dados capturados a partir do segundo clock
	#define SSP1_STANDARD (0x7)

#define SSP1CR1        (*(reg32 *)(SSP1_BASE_ADDR + 0x04))
	#define SSP1_LBM_NORMAL    	(0x0)	// Loop back mode normal operation
	#define SSP1_LBM_SOUT    	(0x1)	// Loop back mode pego da saida MISO ou MOSI
	#define SSP1_SSE_OFF   		(0x0)	// SSP enable. O controlador SSP é desabilitado
	#define SSP1_SSE_ON    		(0x2)	// SSP enable. O controlador SSP interage com outros dispositivos seriais
	#define SSP1_MASTER    		(0x0) 	// SSP como mestre
	#define SSP1_SLAVE     		(0x4)	// SSP como escravo
	#define SSP1_SOD     		(0x8)	// Somente usados para modo escravo.

#define SSP1DR         (*(reg32 *)(SSP1_BASE_ADDR + 0x08))

#define SSP1SR         (*(reg32 *)(SSP1_BASE_ADDR + 0x0C))
	#define SSP1_TFE      (0x00000001)	// 1 = FIFO TX = vazio
	#define SSP1_TNF      (0x00000002)	// 1 = FIFO TX não está cheio. 0 = FIFO TX está cheio
	#define SSP1_RNE      (0x00000004)	// 0 = FIFO RX está vazio
	#define SSP1_RFF      (0x00000008)	// 1 = FIFO RX não está cheio
	#define SSP1_BSY      (0x00000010)	// 0 = BUS oscioso. 1 = BUS TX ou RX

#define SSP1CPSR       (*(reg32 *)(SSP1_BASE_ADDR + 0x10))

#define SSP1IMSC       (*(reg32 *)(SSP1_BASE_ADDR + 0x14))
	#define SSP1_RORIM  (0x1)
	#define SSP1_RTIM   (0x2)
	#define SSP1_RXIM   (0x4)
	#define SSP1_TXIM   (0x8)

#define SSP1RIS        (*(reg32 *)(SSP1_BASE_ADDR + 0x18))
	#define SSP1_RORRIS  (0x00000001)
	#define SSP1_RTRIS   (0x00000002)
	#define SSP1_RXRIS   (0x00000004)
	#define SSP1_TXRIS   (0x00000008)

#define SSP1MIS        (*(reg32 *)(SSP1_BASE_ADDR + 0x1C))
	#define SSP1_RORMIS  (0x00000001)
	#define SSP1_RTMIS   (0x00000002)
	#define SSP1_RXMIS   (0x00000004)
	#define SSP1_TXMIS   (0x00000008)

#define SSP1ICR        (*(reg32 *)(SSP1_BASE_ADDR + 0x20))
	#define SSP1_RORIC   (0x00000001)
	#define SSP1_RTIC    (0x00000002)

#define SSP1DMACR      (*(reg32 *)(SSP1_BASE_ADDR + 0x24))

// ########################################################################################################################################
// RTC - REAL TIME CLOCK RTC
#define RTC_BASE_ADDR		0x40024000
//
#define ILR         	(*(reg32 *)(RTC_BASE_ADDR + 0x00))      // Interrupt Location Register
	#define RTCCIF 		(1 << 0) 									// Quando 1 o bloco do timer RTC gera uma interrupção. Escrevendo 1 limpa interrupção
	#define RTCALF		(1 << 1)									// Quando 1 o bloco do alarme gera uma interrupção. Escrevendo 1 limpa interrupção

#define CCR         	(*(reg32 *)(RTC_BASE_ADDR + 0x08))      // Clock Control Register
	#define CLKEN		(1 << 0)									// habilita Clock
	#define CTCRST		(1 << 1)									// Reset
	#define CTTEST		(3 << 2)									// Deve manter 00 na operação normal

#define CIIR        	(*(reg32 *)(RTC_BASE_ADDR + 0x0C))      // Counter Increment Interrupt Register
	#define IMNO		(0)			// Nenhum parametro será usado
  	#define IMSEC		(1 << 0)	// Este bit em 1, quando ocorrer o incremento no valor do segundo, gera interrupção
  	#define IMMIN		(1 << 1)	// Este bit em 1, quando ocorrer o incremento no valor do minuto, gera interrupção
  	#define IMHOUR		(1 << 2)	// Este bit em 1, quando ocorrer o incremento no valor do hora, gera interrupção
  	#define IMDOM		(1 << 3)	// Este bit em 1, quando ocorrer o incremento no valor do dia dos mês, gera interrupção
  	#define IMDOW		(1 << 4)	// Este bit em 1, quando ocorrer o incremento no valor do dia da semana, gera interrupção
  	#define IMDOY		(1 << 5)	// Este bit em 1, quando ocorrer o incremento no valor do do ano, gera interrupção
  	#define IMMON		(1 << 6)	// Este bit em 1, quando ocorrer o incremento no valor do mês, gera interrupção
  	#define IMYEAR		(1 << 7)	// Este bit em 1, quando ocorrer o incremento no valor do ano, gera interrupção

#define AMR         	(*(reg32 *)(RTC_BASE_ADDR + 0x10))      // Alarm Mask Register
	#define AMRNO		(0)											// Nenhum parametro será usado
	#define AMRSEC		(1 << 0)									// Este bit em 1, o valor do segundo não é usado para gerar o alarme
	#define AMRMIN		(1 << 1)									// Este bit em 1, o valor do minuto não é usado para gerar o alarme
	#define AMRHOUR		(1 << 2)									// Este bit em 1, o valor do hora não é usado para gerar o alarme
	#define AMRDOM		(1 << 3)									// Este bit em 1, o valor do dia dos mês não é usado para gerar o alarme
	#define AMRDOW		(1 << 4)									// Este bit em 1, o valor do dia da semana não é usado para gerar o alarme
	#define AMRDOY		(1 << 5)									// Este bit em 1, o valor do do ano não é usado para gerar o alarme
	#define AMRMON		(1 << 6)									// Este bit em 1, o valor do mês não é usado para gerar o alarme
	#define AMRYEAR		(1 << 7)									// Este bit em 1, o valor do ano não é usado para gerar o alarme
	#define AMRMASK		(0xFF)

// REGISTRADORES DE CONTAGEM DE TEMPO
#define CTIME0    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x14))     	// Consolidated Time Register 0
#define CTIME1    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x18))     	// Consolidated Time Register 1
#define CTIME2    	  	(*(reg32 *)(RTC_BASE_ADDR + 0x1C))     	// Consolidated Time Register 2

