andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
// REGISTRADORES DO TEMPO ATUAL
#define SEC         	(*(reg32 *)(RTC_BASE_ADDR + 0x20))      // Seconds Register
#define MIN         	(*(reg32 *)(RTC_BASE_ADDR + 0x24))      // Minutes Register
#define HOUR        	(*(reg32 *)(RTC_BASE_ADDR + 0x28))      // Hours Register
#define DOM         	(*(reg32 *)(RTC_BASE_ADDR + 0x2C))      // Day Of Month Register
#define DOW         	(*(reg32 *)(RTC_BASE_ADDR + 0x30))      // Day Of Week Register
#define DOY         	(*(reg32 *)(RTC_BASE_ADDR + 0x34))      // Day Of Year Register
#define MONTH  	    	(*(reg32 *)(RTC_BASE_ADDR + 0x38))      // Months Register
#define YEAR   	    	(*(reg32 *)(RTC_BASE_ADDR + 0x3C))      // Years Register
//#define CISS        	(*(reg32 *)(RTC_BASE_ADDR + 0x40))

// REGISTRADORES PARA O ALARME
#define ALSEC       	(*(reg32 *)(RTC_BASE_ADDR + 0x60))      // Alarm Seconds Register
#define ALMIN       	(*(reg32 *)(RTC_BASE_ADDR + 0x64))      // Alarm Minutes Register
#define ALHOUR      	(*(reg32 *)(RTC_BASE_ADDR + 0x68))      // Alarm Hours Register
#define ALDOM       	(*(reg32 *)(RTC_BASE_ADDR + 0x6C))      // Alarm Day Of Month Register
#define ALDOW       	(*(reg32 *)(RTC_BASE_ADDR + 0x70))      // Alarm Day Of Week Register
#define ALDOY       	(*(reg32 *)(RTC_BASE_ADDR + 0x74))      // Alarm Day Of Year Register
#define ALMON       	(*(reg32 *)(RTC_BASE_ADDR + 0x78))      // Alarm Months Register
#define ALYEAR   	   	(*(reg32 *)(RTC_BASE_ADDR + 0x7C))      // Alarm Years Register

//// REGISTRADORES PARA CONTROLE DO RTC ATRAVÉS DO CLOCK DA CPU
//#define PREINT      	(*(reg32 *)(RTC_BASE_ADDR + 0x80))    	// Prescale Value Register (integer)
//#define PREFRAC     	(*(reg32 *)(RTC_BASE_ADDR + 0x84))    	// Prescale Value Register (fraction)

// ########################################################################################################################################
// BLOCOS DE CONEXÃO DE PINOS IO
// datasheet pagina 113
#define PINSEL_BASE_ADDR	0x4002C000

#define PINSEL_P0        (*(reg32 *)(PINSEL_BASE_ADDR + 0x000)) // P0[31:0]
#define PINSEL_P1        (*(reg32 *)(PINSEL_BASE_ADDR + 0x080))	// P1[31:0]
#define PINSEL_P2        (*(reg32 *)(PINSEL_BASE_ADDR + 0x100))	// P2[31:0]
#define PINSEL_P3        (*(reg32 *)(PINSEL_BASE_ADDR + 0x180))	// P3[31:0]
#define PINSEL_P4        (*(reg32 *)(PINSEL_BASE_ADDR + 0x200))	// P4[31:0]
#define PINSEL_P5        (*(reg32 *)(PINSEL_BASE_ADDR + 0x280))	// P5[31:0]
	#define PINSEL_MASK					0x7ul
	#define PINSEL_PINMODE_MASK			0x18ul
	#define PINSEL_OPENDRAIN_MASK		0x400ul

	// MODO DO PINO
	#define PINSEL_PINMODE_INACTIVE		(0)			// Sem resistor pull-up ou pull-down
	#define PINSEL_PINMODE_PULLDOWN 	(1ul<<4) 	// Internal pull-down resistor
	#define PINSEL_PINMODE_PULLUP		(2ul<<4)	// Internal pull-up resistor
	#define PINSEL_PINMODE_REPEATER 	(3ul<<4) 	// Repeater mode.


#define IOCON_P0_00 (*(reg32 *)(0x4002C000))
#define IOCON_P0_01 (*(reg32 *)(0x4002C004))
#define IOCON_P0_02 (*(reg32 *)(0x4002C008))
#define IOCON_P0_03 (*(reg32 *)(0x4002C00c))
#define IOCON_P0_04 (*(reg32 *)(0x4002C010))
#define IOCON_P0_05 (*(reg32 *)(0x4002C014))
#define IOCON_P0_06 (*(reg32 *)(0x4002C018))
#define IOCON_P0_07 (*(reg32 *)(0x4002C01c))
#define IOCON_P0_08 (*(reg32 *)(0x4002C020))
#define IOCON_P0_09 (*(reg32 *)(0x4002C024))
#define IOCON_P0_10 (*(reg32 *)(0x4002C028))
#define IOCON_P0_11 (*(reg32 *)(0x4002C02c))
#define IOCON_P0_12 (*(reg32 *)(0x4002C030))
#define IOCON_P0_13 (*(reg32 *)(0x4002C034))
#define IOCON_P0_14 (*(reg32 *)(0x4002C038))
#define IOCON_P0_15 (*(reg32 *)(0x4002C03c))
#define IOCON_P0_16 (*(reg32 *)(0x4002C040))
#define IOCON_P0_17 (*(reg32 *)(0x4002C044))
#define IOCON_P0_18 (*(reg32 *)(0x4002C048))
#define IOCON_P0_19 (*(reg32 *)(0x4002C04c))
#define IOCON_P0_20 (*(reg32 *)(0x4002C050))
#define IOCON_P0_21 (*(reg32 *)(0x4002C054))
#define IOCON_P0_22 (*(reg32 *)(0x4002C058))
#define IOCON_P0_23 (*(reg32 *)(0x4002C05c))
#define IOCON_P0_24 (*(reg32 *)(0x4002C060))
#define IOCON_P0_25 (*(reg32 *)(0x4002C064))
#define IOCON_P0_26 (*(reg32 *)(0x4002C068))
#define IOCON_P0_27 (*(reg32 *)(0x4002C06c))
#define IOCON_P0_28 (*(reg32 *)(0x4002C070))
#define IOCON_P0_29 (*(reg32 *)(0x4002C074))
#define IOCON_P0_30 (*(reg32 *)(0x4002C078))
#define IOCON_P0_31 (*(reg32 *)(0x4002C07c))

#define IOCON_P1_00 (*(reg32 *)(0x4002C080))
#define IOCON_P1_01 (*(reg32 *)(0x4002C084))
#define IOCON_P1_02 (*(reg32 *)(0x4002C088))
#define IOCON_P1_03 (*(reg32 *)(0x4002C08c))
#define IOCON_P1_04 (*(reg32 *)(0x4002C090))
#define IOCON_P1_05 (*(reg32 *)(0x4002C094))
#define IOCON_P1_06 (*(reg32 *)(0x4002C098))
#define IOCON_P1_07 (*(reg32 *)(0x4002C09c))
#define IOCON_P1_08 (*(reg32 *)(0x4002C0a0))
#define IOCON_P1_09 (*(reg32 *)(0x4002C0a4))
#define IOCON_P1_10 (*(reg32 *)(0x4002C0a8))
#define IOCON_P1_11 (*(reg32 *)(0x4002C0ac))
#define IOCON_P1_12 (*(reg32 *)(0x4002C0b0))
#define IOCON_P1_13 (*(reg32 *)(0x4002C0b4))
#define IOCON_P1_14 (*(reg32 *)(0x4002C0b8))
#define IOCON_P1_15 (*(reg32 *)(0x4002C0bc))
#define IOCON_P1_16 (*(reg32 *)(0x4002C0c0))
#define IOCON_P1_17 (*(reg32 *)(0x4002C0c4))
#define IOCON_P1_18 (*(reg32 *)(0x4002C0c8))
#define IOCON_P1_19 (*(reg32 *)(0x4002C0cc))
#define IOCON_P1_20 (*(reg32 *)(0x4002C0d0))
#define IOCON_P1_21 (*(reg32 *)(0x4002C0d4))
#define IOCON_P1_22 (*(reg32 *)(0x4002C0d8))
#define IOCON_P1_23 (*(reg32 *)(0x4002C0dc))
#define IOCON_P1_24 (*(reg32 *)(0x4002C0e0))
#define IOCON_P1_25 (*(reg32 *)(0x4002C0e4))
#define IOCON_P1_26 (*(reg32 *)(0x4002C0e8))
#define IOCON_P1_27 (*(reg32 *)(0x4002C0ec))
#define IOCON_P1_28 (*(reg32 *)(0x4002C0f0))
#define IOCON_P1_29 (*(reg32 *)(0x4002C0f4))
#define IOCON_P1_30 (*(reg32 *)(0x4002C0f8))
#define IOCON_P1_31 (*(reg32 *)(0x4002C0fc))

#define IOCON_P2_00 (*(reg32 *)(0x4002C100))
#define IOCON_P2_01 (*(reg32 *)(0x4002C104))
#define IOCON_P2_02 (*(reg32 *)(0x4002C108))
#define IOCON_P2_03 (*(reg32 *)(0x4002C10c))
#define IOCON_P2_04 (*(reg32 *)(0x4002C110))
#define IOCON_P2_05 (*(reg32 *)(0x4002C114))
#define IOCON_P2_06 (*(reg32 *)(0x4002C118))
#define IOCON_P2_07 (*(reg32 *)(0x4002C11c))
#define IOCON_P2_08 (*(reg32 *)(0x4002C120))
#define IOCON_P2_09 (*(reg32 *)(0x4002C124))
#define IOCON_P2_10 (*(reg32 *)(0x4002C128))
#define IOCON_P2_11 (*(reg32 *)(0x4002C12c))
#define IOCON_P2_12 (*(reg32 *)(0x4002C130))
#define IOCON_P2_13 (*(reg32 *)(0x4002C134))
#define IOCON_P2_14 (*(reg32 *)(0x4002C138))
#define IOCON_P2_15 (*(reg32 *)(0x4002C13c))
#define IOCON_P2_16 (*(reg32 *)(0x4002C140))
#define IOCON_P2_17 (*(reg32 *)(0x4002C144))
#define IOCON_P2_18 (*(reg32 *)(0x4002C148))
#define IOCON_P2_19 (*(reg32 *)(0x4002C14c))
#define IOCON_P2_20 (*(reg32 *)(0x4002C150))
#define IOCON_P2_21 (*(reg32 *)(0x4002C154))
#define IOCON_P2_22 (*(reg32 *)(0x4002C158))
#define IOCON_P2_23 (*(reg32 *)(0x4002C15c))
#define IOCON_P2_24 (*(reg32 *)(0x4002C160))
#define IOCON_P2_25 (*(reg32 *)(0x4002C164))
#define IOCON_P2_26 (*(reg32 *)(0x4002C168))
#define IOCON_P2_27 (*(reg32 *)(0x4002C16c))
#define IOCON_P2_28 (*(reg32 *)(0x4002C170))
#define IOCON_P2_29 (*(reg32 *)(0x4002C174))
#define IOCON_P2_30 (*(reg32 *)(0x4002C178))
#define IOCON_P2_31 (*(reg32 *)(0x4002C17c))

