andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define IOCON_P3_00 (*(reg32 *)(0x4002C180))
#define IOCON_P3_01 (*(reg32 *)(0x4002C184))
#define IOCON_P3_02 (*(reg32 *)(0x4002C188))
#define IOCON_P3_03 (*(reg32 *)(0x4002C18c))
#define IOCON_P3_04 (*(reg32 *)(0x4002C190))
#define IOCON_P3_05 (*(reg32 *)(0x4002C194))
#define IOCON_P3_06 (*(reg32 *)(0x4002C198))
#define IOCON_P3_07 (*(reg32 *)(0x4002C19c))
#define IOCON_P3_08 (*(reg32 *)(0x4002C1a0))
#define IOCON_P3_09 (*(reg32 *)(0x4002C1a4))
#define IOCON_P3_10 (*(reg32 *)(0x4002C1a8))
#define IOCON_P3_11 (*(reg32 *)(0x4002C1ac))
#define IOCON_P3_12 (*(reg32 *)(0x4002C1b0))
#define IOCON_P3_13 (*(reg32 *)(0x4002C1b4))
#define IOCON_P3_14 (*(reg32 *)(0x4002C1b8))
#define IOCON_P3_15 (*(reg32 *)(0x4002C1bc))
#define IOCON_P3_16 (*(reg32 *)(0x4002C1c0))
#define IOCON_P3_17 (*(reg32 *)(0x4002C1c4))
#define IOCON_P3_18 (*(reg32 *)(0x4002C1c8))
#define IOCON_P3_19 (*(reg32 *)(0x4002C1cc))
#define IOCON_P3_20 (*(reg32 *)(0x4002C1d0))
#define IOCON_P3_21 (*(reg32 *)(0x4002C1d4))
#define IOCON_P3_22 (*(reg32 *)(0x4002C1d8))
#define IOCON_P3_23 (*(reg32 *)(0x4002C1dc))
#define IOCON_P3_24 (*(reg32 *)(0x4002C1e0))
#define IOCON_P3_25 (*(reg32 *)(0x4002C1e4))
#define IOCON_P3_26 (*(reg32 *)(0x4002C1e8))
#define IOCON_P3_27 (*(reg32 *)(0x4002C1ec))
#define IOCON_P3_28 (*(reg32 *)(0x4002C1f0))
#define IOCON_P3_29 (*(reg32 *)(0x4002C1f4))
#define IOCON_P3_30 (*(reg32 *)(0x4002C1f8))
#define IOCON_P3_31 (*(reg32 *)(0x4002C1fc))

#define IOCON_P4_00 (*(reg32 *)(0x4002C200))
#define IOCON_P4_01 (*(reg32 *)(0x4002C204))
#define IOCON_P4_02 (*(reg32 *)(0x4002C208))
#define IOCON_P4_03 (*(reg32 *)(0x4002C20c))
#define IOCON_P4_04 (*(reg32 *)(0x4002C210))
#define IOCON_P4_05 (*(reg32 *)(0x4002C214))
#define IOCON_P4_06 (*(reg32 *)(0x4002C218))
#define IOCON_P4_07 (*(reg32 *)(0x4002C21c))
#define IOCON_P4_08 (*(reg32 *)(0x4002C220))
#define IOCON_P4_09 (*(reg32 *)(0x4002C224))
#define IOCON_P4_10 (*(reg32 *)(0x4002C228))
#define IOCON_P4_11 (*(reg32 *)(0x4002C22c))
#define IOCON_P4_12 (*(reg32 *)(0x4002C230))
#define IOCON_P4_13 (*(reg32 *)(0x4002C234))
#define IOCON_P4_14 (*(reg32 *)(0x4002C238))
#define IOCON_P4_15 (*(reg32 *)(0x4002C23c))
#define IOCON_P4_16 (*(reg32 *)(0x4002C240))
#define IOCON_P4_17 (*(reg32 *)(0x4002C244))
#define IOCON_P4_18 (*(reg32 *)(0x4002C248))
#define IOCON_P4_19 (*(reg32 *)(0x4002C24c))
#define IOCON_P4_20 (*(reg32 *)(0x4002C250))
#define IOCON_P4_21 (*(reg32 *)(0x4002C254))
#define IOCON_P4_22 (*(reg32 *)(0x4002C258))
#define IOCON_P4_23 (*(reg32 *)(0x4002C25c))
#define IOCON_P4_24 (*(reg32 *)(0x4002C260))
#define IOCON_P4_25 (*(reg32 *)(0x4002C264))
#define IOCON_P4_26 (*(reg32 *)(0x4002C268))
#define IOCON_P4_27 (*(reg32 *)(0x4002C26c))
#define IOCON_P4_28 (*(reg32 *)(0x4002C270))
#define IOCON_P4_29 (*(reg32 *)(0x4002C274))
#define IOCON_P4_30 (*(reg32 *)(0x4002C278))
#define IOCON_P4_31 (*(reg32 *)(0x4002C27c))

#define IOCON_P5_00 (*(reg32 *)(0x4002C280))
#define IOCON_P5_01 (*(reg32 *)(0x4002C284))
#define IOCON_P5_02 (*(reg32 *)(0x4002C288))
#define IOCON_P5_03 (*(reg32 *)(0x4002C28c))
#define IOCON_P5_04 (*(reg32 *)(0x4002C290))

// ########################################################################################################################################
// ADC0
#define AD0_BASE_ADDR		0x40034000

#define AD0CR          (*(reg32 *)(AD0_BASE_ADDR + 0x00))
  	#define AD0_CHANNEL0		0
	#define AD0_CHANNEL1		1
	#define AD0_CHANNEL2		2
	#define AD0_CHANNEL3		3
	#define AD0_CHANNEL4		4
	#define AD0_CHANNEL5		5
	#define AD0_CHANNEL6		6
	#define AD0_CHANNEL7		7
	#define AD0_CHANNEL_MASK	(0xFF)

  	#define AD0_STOPPED 		( 0 << 24 )						// Somente no modo não BUSRT. Conversor parado
  	#define AD0_START_NOW		( 1 << 24 )						// Somente no modo não BUSRT. Incializa conversçao agora
  	#define AD0_START_MAT0_0 	( 3 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.0
  	#define AD0_START_MAT0_1 	( 4 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.1
  	#define AD0_START_MAT0_2 	( 2 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.2
  	#define AD0_START_MAT0_3 	( 5 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT0.3
  	#define AD0_START_MAT1_0 	( 6 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT1.0
  	#define AD0_START_MAT1_1 	( 7 << 24 )						// Somente no modo não BUSRT. Incializa conversçao pela mudança da borda do pino MAT1.1
  	#define AD0_START_MASK		( 7 << 24 )

  	#define AD0_EDGE_FALLING 	( 0 << 27 )						// Começa a captura na borda de descrida do gatilho
  	#define AD0_EDGE_RISING		( 1 << 27 )						// Começa a captura na borda de subida do gatilho
  	#define AD0_EDGE_MASK		( 1 << 27 )

  	#define AD0_BUSRT			( 1 << 16)

#define AD0GDR         (*(reg32 *)(AD0_BASE_ADDR + 0x04))
#define AD0INTEN       (*(reg32 *)(AD0_BASE_ADDR + 0x0C))

#define AD0DR0         (*(reg32 *)(AD0_BASE_ADDR + 0x10))
#define AD0DR1         (*(reg32 *)(AD0_BASE_ADDR + 0x14))
#define AD0DR2         (*(reg32 *)(AD0_BASE_ADDR + 0x18))
#define AD0DR3         (*(reg32 *)(AD0_BASE_ADDR + 0x1C))
#define AD0DR4         (*(reg32 *)(AD0_BASE_ADDR + 0x20))
#define AD0DR5         (*(reg32 *)(AD0_BASE_ADDR + 0x24))
#define AD0DR6         (*(reg32 *)(AD0_BASE_ADDR + 0x28))
#define AD0DR7         (*(reg32 *)(AD0_BASE_ADDR + 0x2C))
  	#define AD0_DONE		( 1 << 31 ) 				// Sinaliza quando a conversão ADC esteja completa
  	#define AD0_OVERUN		( 1 << 30 )					// Sinaliza quando os dados de uma ou mais conversções foram perdidos no modo busrt

#define AD0STAT        (*(reg32 *)(AD0_BASE_ADDR + 0x30))
  	// AD0STAT[7:0] Sinaliza o canal que a conversão foi concluida
  	#define AD0_CHANNEL0_DONE		(1 << 0)
	#define AD0_CHANNEL1_DONE		(1 << 1)
	#define AD0_CHANNEL2_DONE		(1 << 2)
	#define AD0_CHANNEL3_DONE		(1 << 3)
	#define AD0_CHANNEL4_DONE		(1 << 4)
	#define AD0_CHANNEL5_DONE		(1 << 5)
	#define AD0_CHANNEL6_DONE		(1 << 6)
	#define AD0_CHANNEL7_DONE		(1 << 7)
	#define AD0_CHANNEL_DONE_MASK	0xFF

  	// AD0STAT[15:8] Sinaliza o canal que a houve overrum no modo burst
  	#define AD0_CHANNEL0_OVERUN	(1 << 8)
	#define AD0_CHANNEL1_OVERUN		(1 << 9)
	#define AD0_CHANNEL2_OVERUN		(1 << 10)
	#define AD0_CHANNEL3_OVERUN		(1 << 11)
	#define AD0_CHANNEL4_OVERUN		(1 << 12)
	#define AD0_CHANNEL5_OVERUN		(1 << 13)
	#define AD0_CHANNEL6_OVERUN		(1 << 14)
	#define AD0_CHANNEL7_OVERUN		(1 << 15)
	#define AD0_CHANNEL_OVERUN_MASK	0xFF00

#define AD0TRM        (*(reg32 *)(AD0_BASE_ADDR + 0x34))

// ########################################################################################################################################
// DAC
#define DAC_BASE_ADDR	0x4008C000
#define DACR           	(*(reg32 *)(DAC_BASE_ADDR + 0x00))
	#define DACR_VALUE_MASK  	(0x0000ffc0)
	#define DACR_VALUE_SHIFT 	(6)
	#define DACR_BIAS       	(0x00010000)
	#define DACR_MASK        	(0x0001ffc0)
#define DACCTRL        	(*(reg32 *)(DAC_BASE_ADDR + 0x04))
#define DACCNTVAL      	(*(reg32 *)(DAC_BASE_ADDR + 0x08))


// ########################################################################################################################################
// BLOCO DE CONTROLE DO SISTEMA (SCB - System Control Block)
*/
#define SCS_BASE_ADDR	0x40048000
/*
#define VTOR *((reg32*) 0xE000ED08) // Define em que região de memória o vetor de ints ficarão
	#define vtor_SetInCode(addr) {VTOR = addr;}
	#define vtor_SetInSram(addr) {VTOR = 0x20000000 | addr;}

#define FLASHCFG       (*(reg32 *)(SCS_BASE_ADDR + 0x000))		// Flash Accelerator Configuration Register
	#define FLASHTIM_20MHZ 0		// Flash accesses use 1 CPU clock. Use for up to 20 MHz CPU clock with power boost off
	#define FLASHTIM_40MHZ (1<<12)	// Flash accesses use 2 CPU clocks. Use for up to 40 MHz CPU clock with power boost off
	#define FLASHTIM_60MHZ (2<<12) 	// Flash accesses use 3 CPU clocks. Use for up to 60 MHz CPU clock with power boost off
	#define FLASHTIM_80MHZ (3<<12)	// Flash accesses use 4 CPU clocks. Use for up to 80 MHz CPU clock with power boost off
									//	Use this setting for operation from 100 to 120 MHz operation with power boost on
	#define FLASHTIM_100MHZ (4<<12)	// Flash accesses use 5 CPU clocks. Use for up to 100 MHz CPU clock with power boost off
	#define FLASHTIM_SAFE 	(5<<12)	// Flash accesses use 6 CPU clocks. “Safe” setting for any allowed conditions
	#define FLASHTIM_AUTO 	(6<<12)	// Configura a velocidade da FLASH automaticamente


// REGISTRADORES PARA TRAVA DE PLL
// PLLCON = PLL0CON
#define PLLCON         (*(reg32 *)(SCS_BASE_ADDR + 0x080))		// Registrador de controle do PLL
	#define pll_OFF()	{ PLLCON = 0; }
	#define pll_ON()	{ PLLCON = 1; }

