andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define PLL1CON         (*(reg32 *)(SCS_BASE_ADDR + 0x0A0))		// Registrador de controle do PLL1
	#define PLLCON_PLLE   (1 << 0)          					// 1 Habilita PLL / 0 - desabilita PLL
	#define pll1_OFF()	{ PLL1CON = 0; }
	#define pll1_ON()	{ PLL1CON = 1; }

// PLLCFG = PLL0CFG
#define PLLCFG         (*(reg32 *)(SCS_BASE_ADDR + 0x084))		// Registrador de configuração do PLL
#define PLL1CFG         (*(reg32 *)(SCS_BASE_ADDR + 0x0A4))		// Registrador de configuração do PLL1

// PLLSTAT = PLL0STAT
#define PLLSTAT        (*(reg32 *)(SCS_BASE_ADDR + 0x088))		// Registrador de Status
#define PLL1STAT       (*(reg32 *)(SCS_BASE_ADDR + 0x0A8))		// Registrador de Status
	#define PLLSTAT_PLLE  (1 << 8)									// Bit indicador se o PLL está ou não ativado
	#define PLLSTAT_LOCK  (1 << 10)         						// Bit de status de travamento do PLL

// PLLFEED = PLL0FEED
#define PLLFEED        (*(reg32 *)(SCS_BASE_ADDR + 0x08C))		// Registrador de validação de mudança do PLL
#define PLL1FEED       (*(reg32 *)(SCS_BASE_ADDR + 0x0AC))		// Registrador de validação de mudança do PLL1

// REGISTRADOR DE CONTROLE DE CONSUMO (POWER CONTROL datasheet pg59)
#define PCON           (*(reg32 *)(SCS_BASE_ADDR + 0x0C0))		// Registrador de controle de potencia
*/
// datasheet página 20
#define PCONP          (*(reg32 *)(SCS_BASE_ADDR + 0x080))		// Registrador SYSAHBCLKCTRL de controle de potencia do sistema e dos perifericos e
	#define PCGPIO 			(1 << 6)	// Power/clock control bit for IOCON, GPIO, and GPIO interrup. Reset = 0
	#define PICON 			(1 << 16)	// IOCON
//	#define PCLCD			(1 << 0)	// LCD power/clock control bit. Reset = 0
//	#define PCTIM0			(1 << 1)	// Timer/Counter 0 power/clock control bit. Reset = 1
//	#define PCTIM1		 	(1 << 2)	// Timer/Counter 1 power/clock control bit. Reset = 1
//	#define PCUART0		 	(1 << 3)	// UART0 power/clock control bit. Reset = 1
//	#define PCUART1 		(1 << 4)	// UART1 power/clock control bit. Reset = 1
//	#define PCPWM0 			(1 << 5)	// PWM0 power/clock control bit. Reset = 0
//	#define PCPWM1 		 	(1 << 6)	// PWM1 power/clock control bit. Reset = 0
//	#define PCI2C0 		 	(1 << 7)	// The I2C0 interface power/clock control bit. Reset = 1
//	#define PCUART4		 	(1 << 8)	// UART0 power/clock control bit. Reset = 0
//	#define PCRTC 			(1 << 9)	// The RTC power/clock control bit. Reset = 1
//	#define PCSSP1 			(1 << 10)	// The SSP1 interface power/clock control bit. Reset = 0
//	#define PCEMC 		 	(1 << 11)	// External Memory Controller Reset = 0
//	#define PCAD 		 	(1 << 12)	// A/D converter (ADC) power/clock control bit. Reset = 0
//	#define PCCAN1 		 	(1 << 13)	// CAN Controller 1 power/clock control bit. Reset = 0
//	#define PCCAN2 			(1 << 14)	// CAN Controller 2 power/clock control bit. Reset = 0

//	#define PCMCPWM 		(1 << 17)	// Motor Control PWM power/clock control bit. Reset = 0
//	#define PCQEI   		(1 << 18)	// Quadrature Encoder Interface power/clock control bit. Reset = 0
//	#define PCI2C1 			(1 << 19)	// The I2C1 interface power/clock control bit. Reset = 1
//	#define PCSSP2 	 	 	(1 << 20)	// SSP2 interface power/clock control bit. Reset = 0
//	#define PCSSP0 	 	 	(1 << 21)	// SSP0 interface power/clock control bit. Reset = 0
//	#define PCTIM2 			(1 << 22)	// Timer 2 power/clock control bit. Reset = 0
//	#define PCTIM3 			(1 << 23)	// Timer 3 power/clock control bit. Reset = 0
//	#define PCUART2 		(1 << 24)	// UART 2 power/clock control bit. Reset = 0
//	#define PCUART3 		(1 << 25)	// UART 3 power/clock control bit. Reset = 0
//	#define PCI2C2 			(1 << 26)	// I2S interface 2 power/clock control bit.  Reset = 1
//	#define PCI2S 			(1 << 27)	// I2S interface power/clock control bit. Reset = 0
//	#define PCSDC 			(1 << 28)	// SD card interface power/clock control bit.  Reset = 0
//	#define PCGPDMA  		(1 << 29)	// GP DMA function power/clock control bit.  Reset = 0
//	#define PCENET 			(1 << 30)	// Ethernet block power/clock control bit.  Reset = 0
//	#define PCUSB 			(1 << 31)	// USB interface power/clock control bit.  Reset = 0
/*
// REGISTRADOR DIVISÃO DE CLOCK
#define CLKSRCSEL     	(*(reg32 *)(SCS_BASE_ADDR + 0x10C))		// Registrador para selecionar o tipo de oscilador para o PLL
	#define clksrcsel_oscRC() 		{ CLKSRCSEL = 0; }
	#define clksrcsel_oscMAIN() 	{ CLKSRCSEL = 1; }
#define CCLKSEL     	(*(reg32 *)(SCS_BASE_ADDR + 0x104))		// CPU Clock Selection register
	#define cclksel_sysClk() 	{ CCLKSEL &= ~(1UL<<8);} 				// Seleciona o oscilador RC para o divisor do CCLK, PCLK e MEMCLK
	#define cclksel_PLL() 		{ CCLKSEL |= (1UL<<8); } 	// Seleciona o oscilador MAIN para o divisor do CCLK, PCLK e MEMCLK
	#define cclksel_clkDiv(div) { CCLKSEL = (CCLKSEL & (~(0x1f))) | (div&0x1f); }
#define USBCLKSEL		(*(reg32 *)(SCS_BASE_ADDR + 0x108))		// USB Clock Selection register
	#define usbksel_sysClk() 	{ USBCLKSEL &= ~(3UL<<8)}
	#define usbksel_PLL0() 		{ USBCLKSEL = (USBCLKSEL & (~(3UL<<8))) | (1UL<<8); }
	#define usbksel_PLL1() 		{ USBCLKSEL = (USBCLKSEL & (~(3UL<<8))) | (2UL<<8); }
	#define usbksel_clkDiv(div) { USBCLKSEL = (USBCLKSEL & (~(0x1f))) | (div&0x1f); }
#define EMCCLKSEL		(*(reg32 *)(SCS_BASE_ADDR + 0x100))		// External Memory Controller Clock Selection register
	#define MCLK_FULL_CCLK 0 // Barramento de memória vai acessar na mesma velocidade do PLL
	#define MCLK_HALF_CCLK 1 // Barramento de memória vai acessar com a metade da velocidade do PLL
#define PCLKSEL			(*(reg32 *)(SCS_BASE_ADDR + 0x1A8))		// Peripheral Clock Selection register
	#define pclksel_clkDiv(div) { PCLKSEL = div;}

#define CLKOUTCFG 	(*(reg32*)(SCS_BASE_ADDR + 0x1c8))

// INDENTIFICAÇÃO DE ORIGEM DO RESET
#define RSID           (*(reg32 *)(SCS_BASE_ADDR + 0x180))

// CONTROLE E STATUS DO SISTEMA
#define SCS            (*(reg32 *)(SCS_BASE_ADDR + 0x1A0))
	#define SCS_OSCRANGE_1MHZ_20MHZ		0x0					// Define que o a frequencia de entrada do clock para o oscilador principal está na faixa de 1MHZ a 20MHZ
	#define SCS_OSCRANGE_15MHZ_25MHZ	0x10				// Define que o a frequencia de entrada do clock para o oscilador principal está na faixa de 15MHZ a 25MHZ
	#define SCS_OSCEN					(1 << 5)			// Bit para ligar o oscilador principal
	#define SCS_OSCSTAT					(1 << 6)			// Bit para verificar se o oscilador principal está pronto para uso
	#define scs_oscOFF()				{SCS &= ~(1ul<<5); }
	#define scs_oscON()					{SCS |= (1ul<<5); }


// VALORES PADRÕES DE SEGURANÇA DE ERROS DE CONFIGURAÇÃO
#define F_CPU_MIN 			1000000 	// 1MHz
#define F_CPU_MAX 			25000000	// 25MHz
#define CCLK_MIN			10000000	// 10MHz
#define CCLK_MAX			120000000	// 120MHz
#define PCLK_MIN			30000000	// 30MHz
#define PCLK_MAX			120000000	// 120MHz
#define FCCO_MIN			156000000	// 156MHz
#define FCCO_MAX			320000000	// 320MHz
#define PLL_OUT_MIN			9750000		// 9.75MHz
#define PLL_OUT_MAX			160000000	// 160MHz
#define PLL_M_MIN			0
#define PLL_M_MAX			31

// ########################################################################################################################################
// EINT - REGISTRADORES DE INTERRUPÇÕES EXTERNAS

#define EINT0					0x1			// Interrupção externa 0
#define EINT1					0x2			// Interrupção externa 1
#define EINT2					0x4			// Interrupção externa 2
#define EINT3					0x8			// Interrupção externa 3
//
#define EXTINT         (*(reg32 *)(0x400FC140))
   	// 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
   		// Escrever 1 limpa o flag de interrupção

#define EXTMODE        (*(reg32 *)(0x400FC148))
   	// 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
	// EXTMODE - Modo de trigger de interrupção
	#define EXTMODE_LEVEL 		0 			// Sensivel ao nivel do sinal
	#define EXTMODE_EDGE 		1 			// Sensivel a borda do sinal

