andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define EXTPOLAR       (*(reg32 *)(0x400FC14C))
    // 	X		X		X		X 	EINT3 	EINT2 	EINT1 	EINT0
	// EXTPOLAR - Polaridade da sensibilidade da interrupção
	#define EXTPOLAR_LOW 		0			// Sensivel ao nivel baixo ou na queda do sinal
	#define EXTPOLAR_HIGH 		1			// Sensivel ao nivel alto ou na subida do sinal

// ########################################################################################################################################
// CONTROLADOR DE ACESSO DA MEMÓRIA EXTERNA
// datasheet pg 164
// EXTERNAL MEMORY CONTROLLER (EMC)
#define EMC_BASE_ADDR		0x2009c000
#define EMC_CTRL       		(*(reg32 *)(EMC_BASE_ADDR + 0x000))
#define EMC_STAT       		(*(reg32 *)(EMC_BASE_ADDR + 0x004))
#define EMC_CONFIG     	 	(*(reg32 *)(EMC_BASE_ADDR + 0x008))

// DYNAMIC RAM ACCESS REGISTERS
#define EMC_DYN_CTRL     	(*(reg32 *)(EMC_BASE_ADDR + 0x020))
#define EMC_DYN_RFSH     	(*(reg32 *)(EMC_BASE_ADDR + 0x024))
#define EMC_DYN_RD_CFG   	(*(reg32 *)(EMC_BASE_ADDR + 0x028))
#define EMC_DYN_RP      	(*(reg32 *)(EMC_BASE_ADDR + 0x030))
#define EMC_DYN_RAS      	(*(reg32 *)(EMC_BASE_ADDR + 0x034))
#define EMC_DYN_SREX     	(*(reg32 *)(EMC_BASE_ADDR + 0x038))
#define EMC_DYN_APR      	(*(reg32 *)(EMC_BASE_ADDR + 0x03C))
#define EMC_DYN_DAL      	(*(reg32 *)(EMC_BASE_ADDR + 0x040))
#define EMC_DYN_WR       	(*(reg32 *)(EMC_BASE_ADDR + 0x044))
#define EMC_DYN_RC       	(*(reg32 *)(EMC_BASE_ADDR + 0x048))
#define EMC_DYN_RFC      	(*(reg32 *)(EMC_BASE_ADDR + 0x04C))
#define EMC_DYN_XSR      	(*(reg32 *)(EMC_BASE_ADDR + 0x050))
#define EMC_DYN_RRD      	(*(reg32 *)(EMC_BASE_ADDR + 0x054))
#define EMC_DYN_MRD      	(*(reg32 *)(EMC_BASE_ADDR + 0x058))

#define EMC_DYN_CFG0     	(*(reg32 *)(EMC_BASE_ADDR + 0x100))
#define EMC_DYN_RASCAS0  	(*(reg32 *)(EMC_BASE_ADDR + 0x104))
#define EMC_DYN_CFG1     	(*(reg32 *)(EMC_BASE_ADDR + 0x120))
#define EMC_DYN_RASCAS1  	(*(reg32 *)(EMC_BASE_ADDR + 0x124))
#define EMC_DYN_CFG2     	(*(reg32 *)(EMC_BASE_ADDR + 0x140))
#define EMC_DYN_RASCAS2  	(*(reg32 *)(EMC_BASE_ADDR + 0x144))
#define EMC_DYN_CFG3     	(*(reg32 *)(EMC_BASE_ADDR + 0x160))
#define EMC_DYN_RASCAS3  	(*(reg32 *)(EMC_BASE_ADDR + 0x164))

#define EMC_DYN_DLYCTL  	(*(reg32 *)(0x400fc1dc))
#define EMC_CAL  			(*(reg32 *)(0x400fc1e0))

// STATIC RAM ACCESS REGISTERS
#define EMC_STA_EXT_WAIT  	(*(reg32 *)(EMC_BASE_ADDR + 0x080))
#define EMC_STA_CFG0      	(*(reg32 *)(EMC_BASE_ADDR + 0x200))
#define EMC_STA_WAITWEN0  	(*(reg32 *)(EMC_BASE_ADDR + 0x204))
#define EMC_STA_WAITOEN0  	(*(reg32 *)(EMC_BASE_ADDR + 0x208))
#define EMC_STA_WAITRD0   	(*(reg32 *)(EMC_BASE_ADDR + 0x20C))
#define EMC_STA_WAITPAGE0 	(*(reg32 *)(EMC_BASE_ADDR + 0x210))
#define EMC_STA_WAITWR0   	(*(reg32 *)(EMC_BASE_ADDR + 0x214))
#define EMC_STA_WAITTURN0 	(*(reg32 *)(EMC_BASE_ADDR + 0x218))

#define EMC_STA_CFG1      	(*(reg32 *)(EMC_BASE_ADDR + 0x220))
#define EMC_STA_WAITWEN1  	(*(reg32 *)(EMC_BASE_ADDR + 0x224))
#define EMC_STA_WAITOEN1  	(*(reg32 *)(EMC_BASE_ADDR + 0x228))
#define EMC_STA_WAITRD1   	(*(reg32 *)(EMC_BASE_ADDR + 0x22C))
#define EMC_STA_WAITPAGE1 	(*(reg32 *)(EMC_BASE_ADDR + 0x230))
#define EMC_STA_WAITWR1   	(*(reg32 *)(EMC_BASE_ADDR + 0x234))
#define EMC_STA_WAITTURN1 	(*(reg32 *)(EMC_BASE_ADDR + 0x238))

#define EMC_STA_CFG2      	(*(reg32 *)(EMC_BASE_ADDR + 0x240))
#define EMC_STA_WAITWEN2  	(*(reg32 *)(EMC_BASE_ADDR + 0x244))
#define EMC_STA_WAITOEN2  	(*(reg32 *)(EMC_BASE_ADDR + 0x248))
#define EMC_STA_WAITRD2   	(*(reg32 *)(EMC_BASE_ADDR + 0x24C))
#define EMC_STA_WAITPAGE2 	(*(reg32 *)(EMC_BASE_ADDR + 0x250))
#define EMC_STA_WAITWR2   	(*(reg32 *)(EMC_BASE_ADDR + 0x254))
#define EMC_STA_WAITTURN2 	(*(reg32 *)(EMC_BASE_ADDR + 0x258))

#define EMC_STA_CFG3      	(*(reg32 *)(EMC_BASE_ADDR + 0x260))
#define EMC_STA_WAITWEN3  	(*(reg32 *)(EMC_BASE_ADDR + 0x264))
#define EMC_STA_WAITOEN3  	(*(reg32 *)(EMC_BASE_ADDR + 0x268))
#define EMC_STA_WAITRD3   	(*(reg32 *)(EMC_BASE_ADDR + 0x26C))
#define EMC_STA_WAITPAGE3 	(*(reg32 *)(EMC_BASE_ADDR + 0x270))
#define EMC_STA_WAITWR3   	(*(reg32 *)(EMC_BASE_ADDR + 0x274))
#define EMC_STA_WAITTURN3 	(*(reg32 *)(EMC_BASE_ADDR + 0x278))

// ########################################################################################################################################
// VECTORED INTERRUPT CONTROLLER

#define VIC_BASE_ADDR		0xE000E000

// ANEXOS PARA CANAIS NVIC para core ARM
#define VIC_MEMORYMANAGEMENT          -12      //!< 4 Cortex-M3 Memory Management Interrupt
#define VIC_BUSFAULT                  -11      //!< 5 Cortex-M3 Bus Fault Interrupt        
#define VIC_USAGEFAULT                -10      //!< 6 Cortex-M3 Usage Fault Interrupt      
#define VIC_SVCALL                    -5       //!< 11 Cortex-M3 SV Call Interrupt         
#define VIC_PENDSV                    -2       //!< 14 Cortex-M3 Pend SV Interrupt         
#define VIC_SYSTICK                   -1       //!< 15 Cortex-M3 System Tick Interrupt     

#define SHPR1   (*(reg32 *)(VIC_BASE_ADDR + 0xD18))
#define SHPR2   (*(reg32 *)(VIC_BASE_ADDR + 0xD1C))
#define SHPR3   (*(reg32 *)(VIC_BASE_ADDR + 0xD20))

// ANEXOS PARA CANAIS NVIC para os periféricos
#define VIC_WDT         0 	// Interrupção watchdog
#define VIC_TIMER0      1 	// Interrupção Timer 0
#define VIC_TIMER1      2	// Interrupção Timer 1
#define VIC_TIMER2      3 	// Interrupção Timer 2
#define VIC_TIMER3      4	// Interrupção Timer 3
#define VIC_UART0       5	// Interrupção UART 0
#define VIC_UART1       6	// Interrupção UART 1
#define VIC_UART2		7	// Interrupção UART 2
#define VIC_UART3		8	// Interrupção UART 3
#define VIC_PWM1       	9	// Interrupção PWM 1
#define VIC_I2C0        10	// Interrupção I2C 0
#define VIC_I2C1        11	// Interrupção I2C 1
#define VIC_I2C2        12	// Interrupção I2C 2
#define VIC_SSP0		14	// Interrupção SSP 0
#define VIC_SSP1		15	// Interrupção SSP 1
#define VIC_PLL0		16	// Interrupção PLL 0 (MAIN)
#define VIC_RTC			17	// Interrupção RTC 0
#define VIC_EINT0		18	// Interrupção externa 0
#define VIC_EINT1		19	// Interrupção externa 1
#define VIC_EINT2		20	// Interrupção externa 2
#define VIC_EINT3		21	// Interrupção externa 3
#define VIC_ADC			22	// Interrupção ADC
#define VIC_BOD			23	// Interrupção detecção brown out
#define VIC_USB			24	// Interrupção USB
#define VIC_CAN			25	// Interrupção CAN
#define VIC_DMA			26	// Interrupção General Purpose DMA
#define VIC_I2S			27
#define VIC_ENET		28	// Interrupção Ethernet
#define VIC_SD			29
#define VIC_MCPWM		30	// Interrupção Motor Control PWM
#define VIC_QEI			31	// Interrupção Quadrature Encoder Interface
#define VIC_PLL1		32	// Interrupção PLL1 Lock (USB PLL)
#define VIC_USBACT		33	// Interrupção USB Activity interrupt
#define VIC_CANACT		34	// Interrupção CAN Activity interrupt
#define VIC_UART4		35	// Interrupção UART 4
#define VIC_SSP2		36	// Interrupção SSP 2
#define VIC_LCD			37
#define VIC_GPIO		38
#define VIC_PWM0       	39
#define VIC_FLASH     	40	// Flash e eeprom

#define VIC_SIZE			32
#define VIC_PRIO_BITS       5         //!< Number of Bits used for Priority Levels          

// REGISTRADORES PARA HABILITAR INTERRUPÇÕES
#define ISER0   (*(reg32 *)(VIC_BASE_ADDR + 0x100)) // Habilita interrupções
#define ISER1   (*(reg32 *)(VIC_BASE_ADDR + 0x104))

// REGISTRADORES PARA DESABILITAR INTERRUPÇÕES
#define ICER0   (*(reg32 *)(VIC_BASE_ADDR + 0x180))
#define ICER1   (*(reg32 *)(VIC_BASE_ADDR + 0x184))

