andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
// REGISTRADORES PARA FORÇAR A INTERRUPÇÃO PARA MODO PENDENTE
#define ISPR0   (*(reg32 *)(VIC_BASE_ADDR + 0x200))
#define ISPR1   (*(reg32 *)(VIC_BASE_ADDR + 0x204))

// REGISTRADORES PARA REMOVER AS INTERRUPÇÕES DO MODO DE PEDENCIAS
#define ICPR0   (*(reg32 *)(VIC_BASE_ADDR + 0x280))
#define ICPR1   (*(reg32 *)(VIC_BASE_ADDR + 0x284))

// REGISTRADORES PARA INIDCAR QUAL A INTERRUPÇÃO ESTÁ ATIVA - somente de leitura
#define IABR0   (*(reg32 *)(VIC_BASE_ADDR + 0x300))
#define IABR1   (*(reg32 *)(VIC_BASE_ADDR + 0x304))

// REGISTRADORES PARA AJUSTAR AS PRIORIDADES DAS INTERRUPÇÕES
#define IPR_BASE   (*(reg32 *)(VIC_BASE_ADDR + 0x400))

// REGISTRADOR PARA INTERRUPÇÃO POR SOFTWARE - somente de escrita
#define STIR   (*(reg32 *)(VIC_BASE_ADDR + 0xF00))

*/
// ########################################################################################################################################
// I/O datasheet pagina 121
// Usados quando a função do pino (IOCON) é 1 (GPIO)
#define GPIO_BASE_ADDR		0x50000000UL

// PORT 0 acesso 32 bits
#define GPIO0_DIR        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2000))
#define GPIO0_MASK       	(*(reg32 *)(GPIO_BASE_ADDR + 0x2080))
#define GPIO0_PIN        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2100))
#define GPIO0_SET        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2200))
#define GPIO0_CLR        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2280))
#define GPIO0_NOT        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2300))

// PORT 0 acesso 32 bits
#define GPIO1_DIR        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2004))
#define GPIO1_MASK       	(*(reg32 *)(GPIO_BASE_ADDR + 0x2084))
#define GPIO1_PIN        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2104))
#define GPIO1_SET        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2204))
#define GPIO1_CLR        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2284))
#define GPIO1_NOT        	(*(reg32 *)(GPIO_BASE_ADDR + 0x2303))

/*
// PORT 0 acesso 16 bits
#define FIO0DIRL       (*(reg16 *)(GPIO_BASE_ADDR + 0x00))
#define FIO0DIRU       (*(reg16 *)(GPIO_BASE_ADDR + 0x02))
#define FIO0MASKL      (*(reg16 *)(GPIO_BASE_ADDR + 0x10))
#define FIO0MASKU      (*(reg16 *)(GPIO_BASE_ADDR + 0x12))
#define FIO0PINL       (*(reg16 *)(GPIO_BASE_ADDR + 0x14))
#define FIO0PINU       (*(reg16 *)(GPIO_BASE_ADDR + 0x16))
#define FIO0SETL       (*(reg16 *)(GPIO_BASE_ADDR + 0x18))
#define FIO0SETU       (*(reg16 *)(GPIO_BASE_ADDR + 0x1A))
#define FIO0CLRL       (*(reg16 *)(GPIO_BASE_ADDR + 0x1C))
#define FIO0CLRU       (*(reg16 *)(GPIO_BASE_ADDR + 0x1E))


// PORT 0 acesso 8 bits
#define FIO0DIR0       (*(reg8 *)(GPIO_BASE_ADDR + 0x00))
#define FIO0DIR1       (*(reg8 *)(GPIO_BASE_ADDR + 0x01))
#define FIO0DIR2       (*(reg8 *)(GPIO_BASE_ADDR + 0x02))
#define FIO0DIR3       (*(reg8 *)(GPIO_BASE_ADDR + 0x03))
#define FIO0MASK0      (*(reg8 *)(GPIO_BASE_ADDR + 0x10))
#define FIO0MASK1      (*(reg8 *)(GPIO_BASE_ADDR + 0x11))
#define FIO0MASK2      (*(reg8 *)(GPIO_BASE_ADDR + 0x12))
#define FIO0MASK3      (*(reg8 *)(GPIO_BASE_ADDR + 0x13))
#define FIO0PIN0       (*(reg8 *)(GPIO_BASE_ADDR + 0x14))
#define FIO0PIN1       (*(reg8 *)(GPIO_BASE_ADDR + 0x15))
#define FIO0PIN2       (*(reg8 *)(GPIO_BASE_ADDR + 0x16))
#define FIO0PIN3       (*(reg8 *)(GPIO_BASE_ADDR + 0x17))
#define FIO0SET0       (*(reg8 *)(GPIO_BASE_ADDR + 0x18))
#define FIO0SET1       (*(reg8 *)(GPIO_BASE_ADDR + 0x19))
#define FIO0SET2       (*(reg8 *)(GPIO_BASE_ADDR + 0x1A))
#define FIO0SET3       (*(reg8 *)(GPIO_BASE_ADDR + 0x1B))
#define FIO0CLR0       (*(reg8 *)(GPIO_BASE_ADDR + 0x1C))
#define FIO0CLR1       (*(reg8 *)(GPIO_BASE_ADDR + 0x1D))
#define FIO0CLR2       (*(reg8 *)(GPIO_BASE_ADDR + 0x1E))
#define FIO0CLR3       (*(reg8 *)(GPIO_BASE_ADDR + 0x1F))

//// ########################################################################################################################################
//// CAN CONTROLLERS AND ACCEPTANCE FILTER
//#define CAN_ACCEPT_BASE_ADDR		0xE003C000
//#define CAN_AFMR		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x00))
//#define CAN_SFF_SA 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x04))
//#define CAN_SFF_GRP_SA 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x08))
//#define CAN_EFF_SA 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x0C))
//#define CAN_EFF_GRP_SA 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x10))
//#define CAN_EOT 		(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x14))
//#define CAN_LUT_ERR_ADR (*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x18))
//#define CAN_LUT_ERR 	(*(reg32 *)(CAN_ACCEPT_BASE_ADDR + 0x1C))
//
//#define CAN_CENTRAL_BASE_ADDR		0xE0040000
//#define CAN_TX_SR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x00))
//#define CAN_RX_SR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x04))
//#define CAN_MSR 	(*(reg32 *)(CAN_CENTRAL_BASE_ADDR + 0x08))
//
//#define CAN1_BASE_ADDR		0xE0044000
//#define CAN1MOD 	(*(reg32 *)(CAN1_BASE_ADDR + 0x00))
//#define CAN1CMR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x04))
//#define CAN1GSR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x08))
//#define CAN1ICR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x0C))
//#define CAN1IER 	(*(reg32 *)(CAN1_BASE_ADDR + 0x10))
//#define CAN1BTR 	(*(reg32 *)(CAN1_BASE_ADDR + 0x14))
//#define CAN1EWL 	(*(reg32 *)(CAN1_BASE_ADDR + 0x18))
//#define CAN1SR 		(*(reg32 *)(CAN1_BASE_ADDR + 0x1C))
//#define CAN1RFS 	(*(reg32 *)(CAN1_BASE_ADDR + 0x20))
//#define CAN1RID 	(*(reg32 *)(CAN1_BASE_ADDR + 0x24))
//#define CAN1RDA 	(*(reg32 *)(CAN1_BASE_ADDR + 0x28))
//#define CAN1RDB 	(*(reg32 *)(CAN1_BASE_ADDR + 0x2C))
//
//#define CAN1TFI1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x30))
//#define CAN1TID1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x34))
//#define CAN1TDA1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x38))
//#define CAN1TDB1 	(*(reg32 *)(CAN1_BASE_ADDR + 0x3C))
//#define CAN1TFI2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x40))
//#define CAN1TID2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x44))
//#define CAN1TDA2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x48))
//#define CAN1TDB2 	(*(reg32 *)(CAN1_BASE_ADDR + 0x4C))
//#define CAN1TFI3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x50))
//#define CAN1TID3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x54))
//#define CAN1TDA3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x58))
//#define CAN1TDB3 	(*(reg32 *)(CAN1_BASE_ADDR + 0x5C))
//
//#define CAN2_BASE_ADDR		0xE0048000
//#define CAN2MOD 	(*(reg32 *)(CAN2_BASE_ADDR + 0x00))
//#define CAN2CMR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x04))
//#define CAN2GSR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x08))
//#define CAN2ICR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x0C))
//#define CAN2IER 	(*(reg32 *)(CAN2_BASE_ADDR + 0x10))
//#define CAN2BTR 	(*(reg32 *)(CAN2_BASE_ADDR + 0x14))
//#define CAN2EWL 	(*(reg32 *)(CAN2_BASE_ADDR + 0x18))
//#define CAN2SR 		(*(reg32 *)(CAN2_BASE_ADDR + 0x1C))
//#define CAN2RFS 	(*(reg32 *)(CAN2_BASE_ADDR + 0x20))
//#define CAN2RID 	(*(reg32 *)(CAN2_BASE_ADDR + 0x24))
//#define CAN2RDA 	(*(reg32 *)(CAN2_BASE_ADDR + 0x28))
//#define CAN2RDB 	(*(reg32 *)(CAN2_BASE_ADDR + 0x2C))
//
//#define CAN2TFI1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x30))
//#define CAN2TID1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x34))
//#define CAN2TDA1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x38))
//#define CAN2TDB1 	(*(reg32 *)(CAN2_BASE_ADDR + 0x3C))
//#define CAN2TFI2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x40))
//#define CAN2TID2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x44))
//#define CAN2TDA2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x48))
//#define CAN2TDB2 	(*(reg32 *)(CAN2_BASE_ADDR + 0x4C))
//#define CAN2TFI3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x50))
//#define CAN2TID3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x54))
//#define CAN2TDA3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x58))
//#define CAN2TDB3 	(*(reg32 *)(CAN2_BASE_ADDR + 0x5C))
//
// ########################################################################################################################################
// MultiMedia Card Interface(MCI) Controller
#define MCI_BASE_ADDR		0x400C0000
#define MCI_POWER      (*(reg32 *)(MCI_BASE_ADDR + 0x00))
#define MCI_CLOCK      (*(reg32 *)(MCI_BASE_ADDR + 0x04))
#define MCI_ARGUMENT   (*(reg32 *)(MCI_BASE_ADDR + 0x08))
#define MCI_COMMAND    (*(reg32 *)(MCI_BASE_ADDR + 0x0C))
#define MCI_RESP_CMD   (*(reg32 *)(MCI_BASE_ADDR + 0x10))
#define MCI_RESP0      (*(reg32 *)(MCI_BASE_ADDR + 0x14))
#define MCI_RESP1      (*(reg32 *)(MCI_BASE_ADDR + 0x18))
#define MCI_RESP2      (*(reg32 *)(MCI_BASE_ADDR + 0x1C))
#define MCI_RESP3      (*(reg32 *)(MCI_BASE_ADDR + 0x20))
#define MCI_DATA_TMR   (*(reg32 *)(MCI_BASE_ADDR + 0x24))
#define MCI_DATA_LEN   (*(reg32 *)(MCI_BASE_ADDR + 0x28))
#define MCI_DATA_CTRL  (*(reg32 *)(MCI_BASE_ADDR + 0x2C))
#define MCI_DATA_CNT   (*(reg32 *)(MCI_BASE_ADDR + 0x30))
#define MCI_STATUS     (*(reg32 *)(MCI_BASE_ADDR + 0x34))
#define MCI_CLEAR      (*(reg32 *)(MCI_BASE_ADDR + 0x38))
#define MCI_MASK0      (*(reg32 *)(MCI_BASE_ADDR + 0x3C))
#define MCI_FIFO_CNT   (*(reg32 *)(MCI_BASE_ADDR + 0x48))
#define MCI_FIFO       (*(reg32 *)(MCI_BASE_ADDR + 0x80))
//
//// ########################################################################################################################################
//// I2S Interface Controller (I2S)
//#define I2S_BASE_ADDR		0xE0088000
//#define I2S_DAO        (*(reg32 *)(I2S_BASE_ADDR + 0x00))
//#define I2S_DAI        (*(reg32 *)(I2S_BASE_ADDR + 0x04))
//#define I2S_TX_FIFO    (*(reg32 *)(I2S_BASE_ADDR + 0x08))
//#define I2S_RX_FIFO    (*(reg32 *)(I2S_BASE_ADDR + 0x0C))
//#define I2S_STATE      (*(reg32 *)(I2S_BASE_ADDR + 0x10))
//#define I2S_DMA1       (*(reg32 *)(I2S_BASE_ADDR + 0x14))
//#define I2S_DMA2       (*(reg32 *)(I2S_BASE_ADDR + 0x18))
//#define I2S_IRQ        (*(reg32 *)(I2S_BASE_ADDR + 0x1C))
//#define I2S_TXRATE     (*(reg32 *)(I2S_BASE_ADDR + 0x20))
//#define I2S_RXRATE     (*(reg32 *)(I2S_BASE_ADDR + 0x24))
//
//// ########################################################################################################################################
//// General-purpose DMA Controller
//#define DMA_BASE_ADDR		0xFFE04000
//#define GPDMA_INT_STAT         (*(reg32 *)(DMA_BASE_ADDR + 0x000))
//#define GPDMA_INT_TCSTAT       (*(reg32 *)(DMA_BASE_ADDR + 0x004))
//#define GPDMA_INT_TCCLR        (*(reg32 *)(DMA_BASE_ADDR + 0x008))
//#define GPDMA_INT_ERR_STAT     (*(reg32 *)(DMA_BASE_ADDR + 0x00C))
//#define GPDMA_INT_ERR_CLR      (*(reg32 *)(DMA_BASE_ADDR + 0x010))
//#define GPDMA_RAW_INT_TCSTAT   (*(reg32 *)(DMA_BASE_ADDR + 0x014))
//#define GPDMA_RAW_INT_ERR_STAT (*(reg32 *)(DMA_BASE_ADDR + 0x018))
//#define GPDMA_ENABLED_CHNS     (*(reg32 *)(DMA_BASE_ADDR + 0x01C))
//#define GPDMA_SOFT_BREQ        (*(reg32 *)(DMA_BASE_ADDR + 0x020))
//#define GPDMA_SOFT_SREQ        (*(reg32 *)(DMA_BASE_ADDR + 0x024))
//#define GPDMA_SOFT_LBREQ       (*(reg32 *)(DMA_BASE_ADDR + 0x028))
//#define GPDMA_SOFT_LSREQ       (*(reg32 *)(DMA_BASE_ADDR + 0x02C))
//#define GPDMA_CONFIG           (*(reg32 *)(DMA_BASE_ADDR + 0x030))
//#define GPDMA_SYNC             (*(reg32 *)(DMA_BASE_ADDR + 0x034))
//
//// DMA channel 0 registers
//#define GPDMA_CH0_SRC      (*(reg32 *)(DMA_BASE_ADDR + 0x100))
//#define GPDMA_CH0_DEST     (*(reg32 *)(DMA_BASE_ADDR + 0x104))
//#define GPDMA_CH0_LLI      (*(reg32 *)(DMA_BASE_ADDR + 0x108))
//#define GPDMA_CH0_CTRL     (*(reg32 *)(DMA_BASE_ADDR + 0x10C))
//#define GPDMA_CH0_CFG      (*(reg32 *)(DMA_BASE_ADDR + 0x110))
//
//// DMA channel 1 registers
//#define GPDMA_CH1_SRC      (*(reg32 *)(DMA_BASE_ADDR + 0x120))
//#define GPDMA_CH1_DEST     (*(reg32 *)(DMA_BASE_ADDR + 0x124))
//#define GPDMA_CH1_LLI      (*(reg32 *)(DMA_BASE_ADDR + 0x128))
//#define GPDMA_CH1_CTRL     (*(reg32 *)(DMA_BASE_ADDR + 0x12C))
//#define GPDMA_CH1_CFG      (*(reg32 *)(DMA_BASE_ADDR + 0x130))
//
// ########################################################################################################################################
// USB Controller
#define USB_INT_BASE_ADDR	0x400FC1C0
#define USB_BASE_ADDR		0x2008C200		// Endereço base dos registradores USB
#define USB_RAM_BASE		0x20000000		// Endereço base da SRAM interna reservado para o USB

//#define USB_INT_STAT    (*(reg32 *)(USB_INT_BASE_ADDR + 0x00))
//
//// USB Device Interrupt Registers
//#define DEV_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0x00))
//#define DEV_INT_EN      (*(reg32 *)(USB_BASE_ADDR + 0x04))
//#define DEV_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0x08))
//#define DEV_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0x0C))
//#define DEV_INT_PRIO    (*(reg32 *)(USB_BASE_ADDR + 0x2C))
//
//// USB Device Endpoint Interrupt Registers
//#define EP_INT_STAT     (*(reg32 *)(USB_BASE_ADDR + 0x30))
//#define EP_INT_EN       (*(reg32 *)(USB_BASE_ADDR + 0x34))
//#define EP_INT_CLR      (*(reg32 *)(USB_BASE_ADDR + 0x38))
//#define EP_INT_SET      (*(reg32 *)(USB_BASE_ADDR + 0x3C))
//#define EP_INT_PRIO     (*(reg32 *)(USB_BASE_ADDR + 0x40))
//
//// USB Device Endpoint Realization Registers
//#define REALIZE_EP      (*(reg32 *)(USB_BASE_ADDR + 0x44))
//#define EP_INDEX        (*(reg32 *)(USB_BASE_ADDR + 0x48))
//#define MAXPACKET_SIZE  (*(reg32 *)(USB_BASE_ADDR + 0x4C))
//
//// USB Device Command Reagisters
//#define CMD_CODE        (*(reg32 *)(USB_BASE_ADDR + 0x10))
//#define CMD_DATA        (*(reg32 *)(USB_BASE_ADDR + 0x14))
//
//// USB Device Data Transfer Registers
//#define RX_DATA         (*(reg32 *)(USB_BASE_ADDR + 0x18))
//#define TX_DATA         (*(reg32 *)(USB_BASE_ADDR + 0x1C))
//#define RX_PLENGTH      (*(reg32 *)(USB_BASE_ADDR + 0x20))
//#define TX_PLENGTH      (*(reg32 *)(USB_BASE_ADDR + 0x24))
//#define USB_CTRL        (*(reg32 *)(USB_BASE_ADDR + 0x28))
//
//// USB Device DMA Registers
//#define DMA_REQ_STAT        (*(reg32 *)(USB_BASE_ADDR + 0x50))
//#define DMA_REQ_CLR         (*(reg32 *)(USB_BASE_ADDR + 0x54))
//#define DMA_REQ_SET         (*(reg32 *)(USB_BASE_ADDR + 0x58))
//#define UDCA_HEAD           (*(reg32 *)(USB_BASE_ADDR + 0x80))
//#define EP_DMA_STAT         (*(reg32 *)(USB_BASE_ADDR + 0x84))
//#define EP_DMA_EN           (*(reg32 *)(USB_BASE_ADDR + 0x88))
//#define EP_DMA_DIS          (*(reg32 *)(USB_BASE_ADDR + 0x8C))
//#define DMA_INT_STAT        (*(reg32 *)(USB_BASE_ADDR + 0x90))
//#define DMA_INT_EN          (*(reg32 *)(USB_BASE_ADDR + 0x94))
//#define EOT_INT_STAT        (*(reg32 *)(USB_BASE_ADDR + 0xA0))
//#define EOT_INT_CLR         (*(reg32 *)(USB_BASE_ADDR + 0xA4))
//#define EOT_INT_SET         (*(reg32 *)(USB_BASE_ADDR + 0xA8))
//#define NDD_REQ_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0xAC))
//#define NDD_REQ_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0xB0))
//#define NDD_REQ_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0xB4))
//#define SYS_ERR_INT_STAT    (*(reg32 *)(USB_BASE_ADDR + 0xB8))
//#define SYS_ERR_INT_CLR     (*(reg32 *)(USB_BASE_ADDR + 0xBC))
//#define SYS_ERR_INT_SET     (*(reg32 *)(USB_BASE_ADDR + 0xC0))
//
// USB Host and OTG registers are for LPC24xx only
// USB Host Controller
#define USBHC_BASE_ADDR		0x2008C000
#define HcRevision         (*(reg32 *)(USBHC_BASE_ADDR + 0x00))
#define HcControl          	(*(reg32 *)(USBHC_BASE_ADDR + 0x04))
	#define  HC_OR_CONTROL_CLE                 0x00000010
	#define  HC_OR_CONTROL_BLE                 0x00000020
	#define  HC_OR_CONTROL_HCFS                0x000000C0
	#define  HC_OR_CONTROL_HC_OPER             0x00000080
#define HcCommandStatus     (*(reg32 *)(USBHC_BASE_ADDR + 0x08))
	#define  HC_OR_CMD_STATUS_HCR   0x00000001
	#define  HC_OR_CMD_STATUS_CLF   0x00000002
	#define  HC_OR_CMD_STATUS_BLF   0x00000004

