andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define HcInterruptStatus         (*(reg32 *)(USBHC_BASE_ADDR + 0x0C))
	#define  HC_OR_INTR_STATUS_WDH             0x00000002
	#define  HC_OR_INTR_STATUS_RHSC            0x00000040

#define HcInterruptEnable           (*(reg32 *)(USBHC_BASE_ADDR + 0x10))
	#define  HC_OR_INTR_ENABLE_WDH             0x00000002
	#define  HC_OR_INTR_ENABLE_RHSC            0x00000040
	#define  HC_OR_INTR_ENABLE_MIE             0x80000000

#define HcInterruptDisable      (*(reg32 *)(USBHC_BASE_ADDR + 0x14))
#define HcHCCA             		(*(reg32 *)(USBHC_BASE_ADDR + 0x18))
#define HcPeriodCurrentED   	(*(reg32 *)(USBHC_BASE_ADDR + 0x1C))
#define HcControlHeadED     	(*(reg32 *)(USBHC_BASE_ADDR + 0x20))
#define HcControlCurrentED      (*(reg32 *)(USBHC_BASE_ADDR + 0x24))
#define HcBulkHeadED 	    	(*(reg32 *)(USBHC_BASE_ADDR + 0x28))
#define HcBulkCurrentED      	(*(reg32 *)(USBHC_BASE_ADDR + 0x2C))
#define HcDoneHead        		(*(reg32 *)(USBHC_BASE_ADDR + 0x30))
#define HcFmInterval 	    	(*(reg32 *)(USBHC_BASE_ADDR + 0x34))
#define HcFmRemaining     		(*(reg32 *)(USBHC_BASE_ADDR + 0x38))
#define HcFmNumber        		(*(reg32 *)(USBHC_BASE_ADDR + 0x3C))
#define HcPeriodicStart     	(*(reg32 *)(USBHC_BASE_ADDR + 0x40))
#define HcLSThreshold        	(*(reg32 *)(USBHC_BASE_ADDR + 0x44))
#define HcRhDescriptorA         (*(reg32 *)(USBHC_BASE_ADDR + 0x48))
#define HcRhDescriptorB         (*(reg32 *)(USBHC_BASE_ADDR + 0x4C))
#define HcRhStatus          	(*(reg32 *)(USBHC_BASE_ADDR + 0x50))
	#define  HC_OR_RH_STATUS_LPSC              0x00010000
	#define  HC_OR_RH_STATUS_DRWE              0x00008000

#define HcRhPortStatus1    (*(reg32 *)(USBHC_BASE_ADDR + 0x54))
#define HcRhPortStatus2    (*(reg32 *)(USBHC_BASE_ADDR + 0x58))
	#define  HC_OR_RH_PORT_CCS                 0x00000001
	#define  HC_OR_RH_PORT_PRS                 0x00000010
	#define  HC_OR_RH_PORT_CSC                 0x00010000
	#define  HC_OR_RH_PORT_PRSC                0x00100000

// USB OTG Controller
#define USBOTG_BASE_ADDR	0x2008C100
#define OTG_INT_STAT        (*(reg32 *)(USBOTG_BASE_ADDR + 0x00))
#define OTG_INT_EN          (*(reg32 *)(USBOTG_BASE_ADDR + 0x04))
#define OTG_INT_SET         (*(reg32 *)(USBOTG_BASE_ADDR + 0x08))
#define OTG_INT_CLR         (*(reg32 *)(USBOTG_BASE_ADDR + 0x0C))
// On LPC23xx, the name is OTGStCtrl, on LPC24xx, the name is OTG_STAT_CTRL
#define OTG_STAT_CTRL       (*(reg32 *)(USBOTG_BASE_ADDR + 0x10))
#define OTG_TIMER           (*(reg32 *)(USBOTG_BASE_ADDR + 0x14))

#define USBOTG_I2C_BASE_ADDR	0xFFE0C300
#define OTG_I2C_RX          (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define OTG_I2C_TX          (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x00))
#define OTG_I2C_STS         (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x04))
#define OTG_I2C_CTL         (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x08))
#define OTG_I2C_CLKHI       (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x0C))
#define OTG_I2C_CLKLO       (*(reg32 *)(USBOTG_I2C_BASE_ADDR + 0x10))

// On LPC23xx, the names are USBClkCtrl and USBClkSt; on LPC24xx, the names are OTG_CLK_CTRL and OTG_CLK_STAT respectively.
#define USBOTG_CLK_BASE_ADDR	0x2008CFF0
#define OTG_CLK_CTRL        (*(reg32 *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define OTG_CLK_STAT        (*(reg32 *)(USBOTG_CLK_BASE_ADDR + 0x08))

// Note: below three register name convention is for LPC23xx USB device only, match with the spec. update in USB Device Section.
#define OTGStCtrl         	(*(reg32 *)(USBOTG_BASE_ADDR + 0x10))
#define USBClkCtrl          (*(reg32 *)(USBOTG_CLK_BASE_ADDR + 0x04))
#define USBClkSt            (*(reg32 *)(USBOTG_CLK_BASE_ADDR + 0x08))
//
//// ########################################################################################################################################
//// Ethernet MAC (32 bit data bus) -- all registers are RW unless indicated in parentheses
//#define MAC_BASE_ADDR		0xFFE00000 // AHB Peripheral # 0
//#define MAC_MAC1            (*(reg32 *)(MAC_BASE_ADDR + 0x000)) // MAC config reg 1
//#define MAC_MAC2            (*(reg32 *)(MAC_BASE_ADDR + 0x004)) // MAC config reg 2
//#define MAC_IPGT            (*(reg32 *)(MAC_BASE_ADDR + 0x008)) // b2b InterPacketGap reg
//#define MAC_IPGR            (*(reg32 *)(MAC_BASE_ADDR + 0x00C)) // non b2b InterPacketGap reg
//#define MAC_CLRT            (*(reg32 *)(MAC_BASE_ADDR + 0x010)) // CoLlision window/ReTry reg
//#define MAC_MAXF            (*(reg32 *)(MAC_BASE_ADDR + 0x014)) // MAXimum Frame reg
//#define MAC_SUPP            (*(reg32 *)(MAC_BASE_ADDR + 0x018)) // PHY SUPPort reg
//#define MAC_TEST            (*(reg32 *)(MAC_BASE_ADDR + 0x01C)) // TEST reg
//#define MAC_MCFG            (*(reg32 *)(MAC_BASE_ADDR + 0x020)) // MII Mgmt ConFiG reg
//#define MAC_MCMD            (*(reg32 *)(MAC_BASE_ADDR + 0x024)) // MII Mgmt CoMmanD reg
//#define MAC_MADR            (*(reg32 *)(MAC_BASE_ADDR + 0x028)) // MII Mgmt ADdRess reg
//#define MAC_MWTD            (*(reg32 *)(MAC_BASE_ADDR + 0x02C)) // MII Mgmt WriTe Data reg (WO)
//#define MAC_MRDD            (*(reg32 *)(MAC_BASE_ADDR + 0x030)) // MII Mgmt ReaD Data reg (RO)
//#define MAC_MIND            (*(reg32 *)(MAC_BASE_ADDR + 0x034)) // MII Mgmt INDicators reg (RO)
//
//#define MAC_SA0             (*(reg32 *)(MAC_BASE_ADDR + 0x040)) // Station Address 0 reg
//#define MAC_SA1             (*(reg32 *)(MAC_BASE_ADDR + 0x044)) // Station Address 1 reg
//#define MAC_SA2             (*(reg32 *)(MAC_BASE_ADDR + 0x048)) // Station Address 2 reg
//
//#define MAC_COMMAND         (*(reg32 *)(MAC_BASE_ADDR + 0x100)) // Command reg
//#define MAC_STATUS          (*(reg32 *)(MAC_BASE_ADDR + 0x104)) // Status reg (RO)
//#define MAC_RXDESCRIPTOR    (*(reg32 *)(MAC_BASE_ADDR + 0x108)) // Rx descriptor base address reg
//#define MAC_RXSTATUS        (*(reg32 *)(MAC_BASE_ADDR + 0x10C)) // Rx status base address reg
//#define MAC_RXDESCRIPTORNUM (*(reg32 *)(MAC_BASE_ADDR + 0x110)) // Rx number of descriptors reg
//#define MAC_RXPRODUCEINDEX  (*(reg32 *)(MAC_BASE_ADDR + 0x114)) // Rx produce index reg (RO)
//#define MAC_RXCONSUMEINDEX  (*(reg32 *)(MAC_BASE_ADDR + 0x118)) // Rx consume index reg
//#define MAC_TXDESCRIPTOR    (*(reg32 *)(MAC_BASE_ADDR + 0x11C)) // Tx descriptor base address reg
//#define MAC_TXSTATUS        (*(reg32 *)(MAC_BASE_ADDR + 0x120)) // Tx status base address reg
//#define MAC_TXDESCRIPTORNUM (*(reg32 *)(MAC_BASE_ADDR + 0x124)) // Tx number of descriptors reg
//#define MAC_TXPRODUCEINDEX  (*(reg32 *)(MAC_BASE_ADDR + 0x128)) // Tx produce index reg
//#define MAC_TXCONSUMEINDEX  (*(reg32 *)(MAC_BASE_ADDR + 0x12C)) // Tx consume index reg (RO)
//
//#define MAC_TSV0            (*(reg32 *)(MAC_BASE_ADDR + 0x158)) // Tx status vector 0 reg (RO)
//#define MAC_TSV1            (*(reg32 *)(MAC_BASE_ADDR + 0x15C)) // Tx status vector 1 reg (RO)
//#define MAC_RSV             (*(reg32 *)(MAC_BASE_ADDR + 0x160)) // Rx status vector reg (RO)
//
//#define MAC_FLOWCONTROLCNT  (*(reg32 *)(MAC_BASE_ADDR + 0x170)) // Flow control counter reg
//#define MAC_FLOWCONTROLSTS  (*(reg32 *)(MAC_BASE_ADDR + 0x174)) // Flow control status reg
//
//#define MAC_RXFILTERCTRL    (*(reg32 *)(MAC_BASE_ADDR + 0x200)) // Rx filter ctrl reg
//#define MAC_RXFILTERWOLSTS  (*(reg32 *)(MAC_BASE_ADDR + 0x204)) // Rx filter WoL status reg (RO)
//#define MAC_RXFILTERWOLCLR  (*(reg32 *)(MAC_BASE_ADDR + 0x208)) // Rx filter WoL clear reg (WO)
//
//#define MAC_HASHFILTERL     (*(reg32 *)(MAC_BASE_ADDR + 0x210)) // Hash filter LSBs reg
//#define MAC_HASHFILTERH     (*(reg32 *)(MAC_BASE_ADDR + 0x214)) // Hash filter MSBs reg
//
//#define MAC_INTSTATUS       (*(reg32 *)(MAC_BASE_ADDR + 0xFE0)) // Interrupt status reg (RO)
//#define MAC_INTENABLE       (*(reg32 *)(MAC_BASE_ADDR + 0xFE4)) // Interrupt enable reg
//#define MAC_INTCLEAR        (*(reg32 *)(MAC_BASE_ADDR + 0xFE8)) // Interrupt clear reg (WO)
//#define MAC_INTSET          (*(reg32 *)(MAC_BASE_ADDR + 0xFEC)) // Interrupt set reg (WO)
//
//#define MAC_POWERDOWN       (*(reg32 *)(MAC_BASE_ADDR + 0xFF4)) // Power-down reg
//#define MAC_MODULEID        (*(reg32 *)(MAC_BASE_ADDR + 0xFFC)) // Module ID reg (RO)



// ########################################################################################################################################
// IAP/ISP
#define IAP_LOCATION            (0x1FFF1FF1) // Definindo o ponto de entrada das funções IAP
#define IAP_CMD_PREPARE         (50)
#define IAP_CMD_COPYRAMTOFLASH  (51)
#define IAP_CMD_ERASE           (52)
#define IAP_CMD_BLANKCHECK      (53)
#define IAP_CMD_READPARTID      (54)
#define IAP_CMD_READBOOTCODEVER (55)
#define IAP_CMD_COMPARE         (56)
#define IAP_CMD_REINVOKEISP     (57)


// ########################################################################################################################################
// TFT datasheet pg 288
#define LCD_BASE_ADDR	0x20088000
#define LCD_CFG        	(*(reg32 *)(0x400FC1B8))			// LCD Configuration and clocking control
#define LCD_TIMH        (*(reg32 *)(LCD_BASE_ADDR + 0x000)) // Horizontal Timing Control register
#define LCD_TIMV        (*(reg32 *)(LCD_BASE_ADDR + 0x004)) // Vertical Timing Control register
#define LCD_POL        	(*(reg32 *)(LCD_BASE_ADDR + 0x008)) // Clock and Signal Polarity Control register
#define LCD_LE        	(*(reg32 *)(LCD_BASE_ADDR + 0x00c)) // Line End Control register 0 R/W 227
#define LCD_UPBASE      (*(reg32 *)(LCD_BASE_ADDR + 0x010)) // Upper Panel Frame Base Address register
#define LCD_LPBASE      (*(reg32 *)(LCD_BASE_ADDR + 0x014)) // Lower Panel Frame Base Address register
#define LCD_CTRL        (*(reg32 *)(LCD_BASE_ADDR + 0x018)) // LCD Control register
#define LCD_INTMSK      (*(reg32 *)(LCD_BASE_ADDR + 0x01c)) // Interrupt Mask register
#define LCD_INTRAW      (*(reg32 *)(LCD_BASE_ADDR + 0x020)) // Raw Interrupt Status register
#define LCD_INTSTAT     (*(reg32 *)(LCD_BASE_ADDR + 0x024)) // Masked Interrupt Status register
#define LCD_INTCLR      (*(reg32 *)(LCD_BASE_ADDR + 0x028)) // Interrupt Clear register
#define LCD_UPCURR      (*(reg32 *)(LCD_BASE_ADDR + 0x02c)) // Upper Panel Current Address Value register
#define LCD_LPCURR      (*(reg32 *)(LCD_BASE_ADDR + 0x030)) // Lower Panel Current Address Value register

