andersonmeurer/relle.pinel-eletrico-cc/srcWorkTemp/rh/firmware/firmware/uc_libc_dev/_arch/arm_lpc/lpc1315.h
#define LCD_PAL_BASE 		(*(u8 *) (LCD_BASE_ADDR + 0x200))
#define LCD_CRSR_IMG_BASE	0x20088800

#define CRSR_CTRL      	(*(reg32 *)(LCD_BASE_ADDR + 0xc00)) // Cursor Control register
#define CRSR_CFG      	(*(reg32 *)(LCD_BASE_ADDR + 0xc04)) // Cursor Configuration register
	#define CRSR_PIX_32				0
	#define CRSR_PIX_64				1
	#define CRSR_ASYNC				0
	#define CRSR_FRAME_SYNC			2
#define CRSR_PAL0      	(*(reg32 *)(LCD_BASE_ADDR + 0xc08)) // Cursor Palette register
#define CRSR_PAL1      	(*(reg32 *)(LCD_BASE_ADDR + 0xc0c)) // Cursor Palette register
#define CRSR_XY     	(*(reg32 *)(LCD_BASE_ADDR + 0xc10)) // Cursor XY Position register
#define CRSR_CLIP      	(*(reg32 *)(LCD_BASE_ADDR + 0xc14)) // Cursor Clip Position register
#define CRSR_INTMSK     (*(reg32 *)(LCD_BASE_ADDR + 0xc20)) // Cursor Interrupt Mask register
#define CRSR_INTCLR     (*(reg32 *)(LCD_BASE_ADDR + 0xc24)) // Cursor Interrupt Clear register
#define CRSR_INTRAW     (*(reg32 *)(LCD_BASE_ADDR + 0xc28)) // Cursor Raw Interrupt Status register
#define CRSR_INTSTAT    (*(reg32 *)(LCD_BASE_ADDR + 0xc2c)) // Cursor Masked Interrupt Status register

// ########################################################################################################################################
// EEPROM
#define EE_BASE_ADDR	0x200000
#define EECMD        	(*(reg32 *)(EE_BASE_ADDR + 0x080))
#define EEADDR        	(*(reg32 *)(EE_BASE_ADDR + 0x084))
#define EEWDATA        	(*(reg32 *)(EE_BASE_ADDR + 0x088))
#define EERDATA        	(*(reg32 *)(EE_BASE_ADDR + 0x08c))
#define EEWSTATE       	(*(reg32 *)(EE_BASE_ADDR + 0x090))
#define EECLKDIV       	(*(reg32 *)(EE_BASE_ADDR + 0x094))
#define EEPWRDWN       	(*(reg32 *)(EE_BASE_ADDR + 0x098))
	#define PWRDWN	1
#define EEINTEN        	(*(reg32 *)(EE_BASE_ADDR + 0xFe4))
#define EEINTENCLR      (*(reg32 *)(EE_BASE_ADDR + 0xFd8))
#define EEINTENSET      (*(reg32 *)(EE_BASE_ADDR + 0xFdc))
#define EEINTSTAT       (*(reg32 *)(EE_BASE_ADDR + 0xFe0))
#define EEINTSTATCLR    (*(reg32 *)(EE_BASE_ADDR + 0xFe8))
#define EEINTSTATSET    (*(reg32 *)(EE_BASE_ADDR + 0xFec))
*/

#endif

